<?php

namespace Database\Seeders;
use App\Models\Audio_Book;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AudioBookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Audio_Book::create([
            'name' => 'فن اللامبالاة',
            'author' =>'مارك مانسون',
            'rate' => '3.90',
            'path' => 'https://drive.ktaab.com/2018/8/Ktaab.com_Fan-almobalah.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223241.jpg',
            'book_details' => 'ظل يُقال لنا طيلة عشرات السنوات إن التفكير الإيجابي هو المفتاح إلى حياة سعيدة ثرية. لكن مارك مانسون يشتم تلك " الإيجابية " ويقول: " فلنكن صادقين، السيء سيء وعلينا أن نتعايش مع هذا ". لا يتهرّب مانسون من الحقائق ولا يغفلها بالسكّر، بل يقولها لنا كما هي: جرعة من الحقيقة الفجِّة الصادقة المنعشة هي ما ينقصنا اليوم. هذا الكتاب ترياق للذهنية التي نهدهد أنفسنا بها، ذهنية " فلنعمل على أن يكون لدينا كلنا شعور طيب " التي غزت المجتمع المعاصر فأفسدت جيلًا بأسره صار ينال ميداليات ذهبية لمجرد الحضور إلى المدرسة.

            ينصحنا مانسون بأن نعرف حدود إمكاناتنا وأن نتقبلها. وأن ندرك مخاوفنا ونواقصنا وما لسنا واثقين منه، وأن نكفّ عن التهرب والفرار من ذلك كله ونبدأ مواجهة الحقائق الموجعة، حتى نصير قادرين على العثور على ما نبحث عنه من جرأة ومثابرة وصدق ومسؤولية وتسامح وحب للمعرفة.
            لا يستطيع كل شخص أن يكون متميزًا متفوقًا. ففي المجتمع ناجحين وفاشلين؛ وقسم من هذا الواقع ليس عادلًا وليس نتيجة غلطتك أنت.
            وصحيح أن المال شيء حسن، لكن اهتمامك بما تفعله بحياتك أحسن كثيرًا؛ فالتجربة هي الثروة الحقيقية.

            إنها لحظة حديث حقيقي صادق لشخص يمسكك من كتفيك وينظر في عينيك. هذا الكتاب صفعة " منعشة لهذا الجيل حتى تساعده في عيش حياة راضية مستقرة.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'الابتزاز العاطفي',
            'author' =>'سوزان فورورد',
            'rate' => '4.11',
            'path' => 'https://drive.ktaab.com/audio/Ktaab.com_alebtzaz_al3atfy.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223316.jpg',
            'book_details' => 'إن الابتزاز العاطفي شكل قوي من أشكال الابتزاز حيث يهددنا القريبون منا بالعقاب ما لم نفعل ما يريدون. إن أصحاب هذا النهج يعرفون مدى تقديرنا لعلاقاتنا معهم ويعرفون نقاط ضعفنا وأدق أسرارنا. فقد يكون آباؤنا أو أمهاتنا أو أزواجنا أو رؤساؤنا أو زملاء العمل أو أصدقاؤنا أو أحباؤنا. ولا يهمهم مدى اهتمامهم بنا فهم يستخدمون قربهم منا لتحقيق غايتهم: ألا وهي الرضوخ لهم. في هذا الكتاب توضح لنا المؤلفة طبيعة العلاقة المحطمة بفعل الابتزاز لتقدم لكل من هو مستهدف أو فريسة للابتزاز الأدوات اللازمة للدفاع عن نفسه فهو تلخيص بإسلوب واضح مبتزل خطوات محددة يمكن أن يتخذها القراء وتقدم قوائم وقصص تجارب وأساليب إتصال واقعية تقوي العلاقات وتنهي دائرة الابتزاز بخير.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'قصة حياتي',
            'author' =>'شارلي شابلن',
            'rate' => '4.01',
            'path' => 'https://ia600707.us.archive.org/31/items/bookaudio_685/5-kissatoHyatyCherlyChapln-1.mp3-Humyo.com.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685222874.jpg',
            'book_details' => 'يقول شابلن في تفسير اجتذابه ذلك القدر من العداء من جانب أميركيين كثيرين: "لقد كانت خطيئتي الكبرى ولا تزال أني غير امتثالي". وهو يعرف نفسه على الشكل التالي: "أنا ما أنا: فرد نسيج وحده ومختلف، خلفي كل ميراث الرغائب والحاجات السلفية، مع كل الأحلام والرغبات والتجارب الشخصية التي أنا محصلتها".
            لقد شكل الرجل ظاهرة ملفتة للنظر إلى أبعد الحدود في مرحلة مهمة جداً من تطور المجتمع الأميركي بالذات، وذلك انطلاقاً من تجربته الخاصة ومعاناته الحميمة. وحين لاحقه القضاء الأميركي باتهامات كاذبة تتعلق بحياته الشخصية في أوائل الأربعينات، كان واضحاً أنه يجري بذلك تدفيعه ثمن أفكاره وخياراته الإنسانية. إلا أنه خرج من تلك المحاكمة منتصراً. والأهم من ذلك أنه شارك من موقعه كفنان عظيم في تحريك المياه الراكدة لمجتمع تغلب عليه، في المستوى السياسي، النزعة المحافظة. وهو ما يلمح إليه بالضبط حين يورد الكلام الذي قاله لاين فوشتفانجر، بعد ختام تلك المحاكمة مباشرة وصدور الحكم ببراءته مما نسب إليه: "أنت الفنان الدرامي الوحيد، الذي سيبقى في تاريخ الولايات المتحدة الأميركية، لأنه أثار التناقض السياسي لبلد بأكمله".
            إن هذا "الفرد" الذي انطلق لعناق العالم بأسره من شوارع لندن الفقيرة، والقيعان المظلمة لطفولته البائسة، متقمصاً صورة المتشرد خفيف الظل، الذي ينكأ بسخريته الناعمة والمحببة قروح المجتمع والحياة، والذي استطاع كما يقولون أن يملأ الدنيا ويشغل الناس بطرافة فنه وعمق ملامسته للشخصية الإنسانية، والتزامه الدائم لقضايا الإنسان المعذب، كان بالتأكيد نسيج وحده. وهو لم يكن ممثلاً ومخرجاً وكاتباً سينمائياً فريداً وحسب، بل يمكن أن نضيف إلى ذلك أنه كاتب سيرة ذاتية بارع، وصاحب ريشة أدبية ملهمة، كما سنرى ونحن نقرأ هذا النص الجميل الطويل، "قصة حياتي"!',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'معالم في الطريق',
            'author' =>'سيد قطب',
            'rate' => '3.92',
            'path' => 'https://ia802807.us.archive.org/8/items/bookaudio_54/10_chunk_1.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685222689.jpg',
            'book_details' => 'من أشهر كتب سيد قطب ومن أكثرها جدلاً. يتحدث فيه الكاتب عن الجيل القرآني الفريد وطبيعة المنهج القرآني، ونشأة المجتمع المسلم، والجهاد في سبيل الله، وجنسية المسلم وعقيدته.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'عبقرية الصديق',
            'author' =>'عباس العقاد',
            'rate' => '3.92',
            'path' => 'https://ia601902.us.archive.org/13/items/01.wav_201305/01.wav.MP3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223476.jpg',
            'book_details' => 'في هذا الكتاب يتحدث عباس محمود العقاد عن الخليفة الأول أبو بكر الصديق ويرد فيه على اتهامات بعض المؤرخين للصديق بالمنهج العلمي وبدون أسلوب انفعالي وخصوصاً مسالة خلافته للدولة الإسلامية. كما أن الكاتب يتحدث في هذا عن مفتاح شخصيته ومفتاح الشخصية حسب رأي الكاتب هو ذلك الشيء الصغير الذي عن طريقه نستطيع الدخول في فهم شخصية الرجل ومفتاح الصديق هو الاعجاب بالبطولة وهي التي دفعته ليكون أول من آمن برسالة النبي محمد لان اعجابه بالرسول هو الذي أدى إلى اعجابه بالرسالة خلاف الخليفة الثاني عمر بن الخطاب والذي أدى اعجابه بالرسالة إلى الاعجاب بالنبي. عبقرية الصديق هو أحد سلسلة العبقريات الإسلامية.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'عبقرية خالد',
            'author' =>'عباس العقاد',
            'rate' => '4.04',
            'path' => 'https://ia600702.us.archive.org/6/items/bookaudio_26/khalid.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223667.jpg',
            'book_details' => 'يعرض الكاتب في هذا العمل العبقرية الفذة لتلك الشخصية التي أثرت الحياة الإسلامية بمناقبها المتعددة، موضحًا نشأته وإسلامه وحياته بين البادية والحرب، ونسبه القبلي ومسيرته مع الرسول ودوره في حروب الردة والفتوحات الإسلامية وعزله، محددًا عناصر عبقريته الحربية ومفتاح شخصيته ونهايته',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'نهج البلاغة',
            'author' =>'الشريف الرضي, علي بن أبي طالب',
            'rate' => '4.56',
            'path' => 'https://ia600708.us.archive.org/20/items/bookaudio_398/1-NahjoAlblagha-1.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223587.jpg',
            'book_details' => '
            نهج البلاغة اسم وضعه الشريف الرضي على كتاب جمع فيه المختار من كلام الإمام علي بن أبي طالب في الخطب والمواعظ والحِكَم وغيرها. ويعد جمع نهج البلاغة من أبرز ما تركه الشريف الرضي.

            تنوع موضوعات نهج البلاغة: معارف راقية في التوحيد، مثل إلهية سامية، نصائح ومواعظ، بيان وتحليل للأحداث السياسية والاجتماعية، عهود للولاة وتنبيههم وغير ذلك.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'شمس العرب تسطع على الغرب',
            'author' =>'سيجريد هونكه',
            'rate' => '4.13',
            'path' => 'https://ia601607.us.archive.org/14/items/bookaudio_505/kiknki.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223420.jpg',
            'book_details' => 'إن هذا الكتاب يتناول "العرب" و"الحضارة العربية" التي شارك في صنعها أشخاص ممن كانوا ذات انتماءات فارسية، هندية هؤلاء وغيرهم ساهموا في رسم معالم تلك الحضارة، وتقول المستشرقة هونكه بأن هؤلاء، كغيرهم من الشعوب التي حكمها العرب، اتحدوا بفضل اللغة العربية والدين الإسلامي، وذابوا بتأثير قوة الشخصية العربية من ناحية، وتأثير الروح العربي الفذّ من ناحية أخرى، من وحدة ثقافية ذات تماسك عظيم، تتحدث المستشرقة في كتابها هذا عن الثقافة العربية التي أثرت تأثيراً كبيراً في الحضارة الغربية. أبرزت المستشرقة ذلك من خلال جوانب حياتية وفكرية وعملية وعلمية كان للثقافة العربية تأثيرها المباشر عليها من خلال الموروث من الألفاظ والأفكار والعلوم التي إن دلت على شيء فهي تدل على الأصل العربي لها. وهدف المستشرقة من وراء عملها هذا كما تقول، هو أن تفي للعرب ديناً استحق منذ زمن بعيد.',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'الأمير',
            'author' =>'مكيافيللي',
            'rate' => '4.03',
            'path' => 'https://ia804709.us.archive.org/32/items/bookaudio_518/alameer.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223388.jpg',
            'book_details' => 'من المؤكد أنك سمعت اسم "ميكافيللي" وسمعت عن مبدئه الشهير "الغاية تبرر الوسيلة". إن هذا المبدأ يجعلك تظن أننا أمام شخص انتهازي نفعي لا يتهم إلا بما يريد الوصول له، دون اعتبار الأخلاق أو الدين أو الإنسانية

            لكننا نؤكد على أن "الموضوع أكبر من هذا بكثير" .. فالقصة ليست قصة جملة صاغها كاتب مهما كانت وأيا من كان .. فنحن نتحدث هنا عن ملامح عصر بأكمله

            ميكافيللي واحد من مؤسسي "عصر النهضة" وأفكار ونظريات ميكافيللي لا تتحدث عن تفاعل البشر بعضهم مع بعض، لكنها تتحدث عن سمات الحاكم الناجح. قد توافق مبادئه وقد تنكرها تماماً، غير أنه من المهم أن تتعرف عليها وعن ميكافيللي وحياته وعصر النهضة

            هذا الكتاب نقدم من خلاله رؤية متكاملة لكاتب مهم، على الأقل لأنه أثر بشدة في تكوين طريقة تفكير قارة كاملة هي قارة أوربا ومازال يؤثر حتى الآن!!',
            'category_id' => '9',
        ]);
        Audio_Book::create([
            'name' => 'النبي',
            'author' =>'جبران خليل جبران',
            'rate' => '4.23',
            'path' => 'https://ia600301.us.archive.org/19/items/bookaudio_749/2.mp3',
            'image' => 'http://127.0.0.1:8000/public/image/1685223131.jpg',
            'book_details' => '"النبى" يعد من أشهر اعمل جبران خليل جبران
            يحتوى كتاب "النبي" من 26 قصيدة نثرية تحكي قصة رجل حكيم اسمه "مصطفى" يرحل عن مدينة من نسج الخيال، حيث قضى فيها 12 سنة منفياً عن بلاده، فطلب منه الأهالي أن يشركهم في علمه ومعرفته فأخبرهم عن الحب والموت والحياة والعمل وغيرها من جوانب حياة الإنسان وكانت هذه القصائد هي خلاصة تجربته التي أرادها جبران أن تنتقل إلى الناس عن طريق الشعر والأدب
            يقول جبران فى الكتاب
            إنّ الحياة تكون بالحقيقة ظلمةً حالكةً إذا لم ترافقها الحركة
            والحركة تكون عمياءَ لا بركةَ فيها إنْ لم ترافقها المعرفة
            والمعرفة تكون عميقةً سقيمةً إنْ لم يرافقها العمل',
            'category_id' => '9',
        ]);
    }
}
