<?php

namespace Database\Seeders;

use App\Models\Book;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Storage;
use Illuminate\Support\Facades\DB;
class BookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
       
book::create([
            'book_name' => 'أرض زيكولا ',
             'author' => ' عمرو عبد الحميد ',
             'rate' => '4.3',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2022/12/D8A7D8B1D8B6D8B2D98AD983D988D984D8A7.pdf
             ',
             'book_details' =>'هي أرض أهلها يتعامل بوحدات الذكاء، فأنت تعمل ولا يتم محاسبتك نقدًا بل تزيد وحدات الذكاء عندك وإذا ما اشتريت شيئًا فإنها تنقص من ذكاءك.
             الفقير يقصد به من لا يملك وحدات ذكاء كثيرة.
             يقام كل سنة يوم تحتفل فيه زيكولا ويسمى يوم الزيكولا، يذبح فيه أفقر شخص في الأرض، حيث يجمع أفقر المواطنين ويتم اختيار ثلاثة منهم يكونون أشد مرضا (فقرا) على أيدي الأطباء ليتم بعد ذلك خضوعهم للعبة تسمى بلعبة الزيكولا  يقوم فيها المختار بالتصويب على مناطق معينة اختارها في ما قبل على مجسم صغير له ينحت بعد اختياره، ومن يصيب أقل المناطق يذبح.
             لا يحق لأحد الخروج من أرض زيكولا في الأيام العادية إلا يوم الزيكولا حيث تفتح الأبواب.
             بخروجك عن أرض زيكولا لا يطبق عليك قانون وحدات الذكاء.
             يوم ولادة طفل ذكر للملك يقام يوم الزيكولا',
             'category_id'=> '1',
            
             'image' => 'image/1685017299.jpg',
         ]);

         book::create([
            'book_name' => ' قواعد العشق الأربعون ',
             'author' => '  ألف شفق  ',
             'rate' => '5',
             'path' => 'https://www.kotobati.com/book/download/9bbbe492-240f-4848-a3f2-6a26d06f722c
             ',
             'book_details' =>'قواعد العشق الأربعون هي رواية للكاتبة التركية ألف شفق نشرت عقب روايتها لقيطة إسطنبول، في هذه الرواية تسرد الكاتبة حكايتين متوازيتين، إحداها في الزمن المعاصر والأخرى في القرن الثالث العشر، عندما واجه الرومي مرشده الروحي، الدرويش المتنقل المعروف باسم «شمس التبريزي» وكيف أنهما معاً جسّدا رسالة شعر الحب الخالدة.

             صدرت رواية The Forty Rules of Love أي (قواعد العشق الأربعون) في الولايات المتحدة الأمريكية في شباط 2010 كما صدرت في المملكة المتحدة عن دار النشر بينغوين في حزيران 2010. وقد بيعت من الكتاب 550,000 فأصبح بذلك الكتاب الأكثر مبيعًا في تركيا.
             
             كاتبة الرواية هي ألف شفق (بالتركية Elif Şafak) هي روائية تركية تكتب باللغتين التركية والإنجليزية، وقد ترجمت أعمالها إلى ما يزيد على ثلاثين لغة.',
             'category_id'=> '1',
            
             'image' => 'image/1685017709.jpg',
         ]);

         book::create([
            'book_name' => ' حياتك الثانية تبدأ عندما تدرك ان لديك حياة واحدة ',
             'author' => '  رافاييل جيوردانو  ',
             'rate' => '3.9',
             'path' => 'https://www.kotobati.com/book/download/9ffa25c8-44ca-4658-bad5-ec8c48639d4b
             ',
             'book_details' =>'انا احلم بأن استطاعة كل انسان ان يحدد مواهبه ويتحمل مسؤولية سعادته....
             يتحدث عن امرأة تفقد السيطره على حياتها وتشعر بالضغط وبدأت تهمل ابنها وزوجها وفجاءة تلتقي بشخص كالمعجزه يعلمها كيف تتحكم في حياتها وكيف تشعر بالسعادة وكيف تسيطر على غضبها وتحقق اهدافها',
             'category_id'=> '1',
            
             'image' => 'image/1685017691.jpg',
         ]);
         book::create([
            'book_name' => '  11:11 رب خرافة خير من ألف واقع  ',
             'author' => '  يوسف جاسم رمضان  ',
             'rate' => '5',
             'path' => 'https://www.kotobati.com/book/download/9c8c1a25-3cce-4305-be40-1d8fdc15d258
             ',
             'book_details' =>'رواية 11:11  رب خرافة خير من ألف واقع تأليف يوسف جاسم رمضان .. كل ما تقارب الساعة 11:10 أجدها تعد أمانيها قبل الجميع.. فدقيقة واحدة كفيلة بتحقيق كل الأماني.. أما أنت أحب كل تفاصيلك أحب كل شيء عن كل شيء فيك .',
             'category_id'=> '1',
            
             'image' => 'image/1685017699.jpg',
         ]);
         book::create([
            'book_name' => ' رواية مذكراتي من العالم الآخر ',
             'author' => 'هدى بكير',
             'rate' => '4',
             'path' => 'https://www.kotobati.com/book/download/f4de9b18-c0b3-4614-aa7a-f34add9d6acf
             ',
             'book_details' =>'رواية مذكراتي من العالم الآخر تأليف هدى بكير .. رواية فانتازيا (خيال) و رومانسية
             شابة تستيقظ بحالة غريبة.. لا تتذكّر أي شيء عن نفسها، و اتضح أنها بعالم آخر!
             " لكن.. من هم؟! هيئتهم غريبة .. رأيت ثلاثة منهم، يغطّون رؤوسهم و أجسادهم المهيبة بعبائة سوداء واسعة.. أخفضت بصري لأري طرف العبائة .. لأجدها ترفرف.. لأنهم بلا أقدام! "',
             'category_id'=> '1',
            
             'image' => 'image/1685017738.jpg',
         ]);
         book::create([
            'book_name' => ' الأسود يليق بك ',
             'author' => 'أحلام مستغانمي',
             'rate' => '3.6',
             'path' => 'https://www.kotobati.com/book/download/301d868d-df01-4f3e-8291-df2ce6fd8765
             ',
             'book_details' =>'رواية الأسود يليق بك  تأليف أحلام مستغانمي .. ما من قصة حب إلا و تبدأ بحركة موسيقية ، قائد الأوركسترا فيها ليس قلبك، إنما القدر الذي يخفي عنك عصاه . بها يقودك نحو سلم موسيقي لا درج له، مادمت لا تملك من سيمفونية العمر لا ((مفتاح صول)) ..ولا القفلة الموسيقية.
             الموسيقى لا تمهلك، إنها تمضي بك سراعا كما الحياة، جدولا طربا، أو شلالا هادرا يلقي بك إلى المصب. تدور بك كفالس محموم، على إيقاعه تبدأقصص الحب ...و تنتهي.
             حاذر أن تغادر حلبة الرقص كي لا تغادرك الحياة.
             لا تكترث للنغمات التي تتساقط من صولفيج حياتك فما هي إلا نوتات',
             'category_id'=> '1',
            
             'image' => 'image/1685017624.jpg',
         ]);

         book::create([
            'book_name' => 'هكذا علمتني الحياة  ',
             'author' => ' مصطفى السباعي  ',
             'rate' => '4.5',
             'path' => 'https://up.4read.net/elkotob/pdf/%D9%87%D9%83%D8%B0%D8%A7%20%D8%B9%D9%84%D9%85%D8%AA%D9%86%D9%8A%20%D8%A7%D9%84%D8%AD%D9%8A%D8%A7%D8%A9%20%D9%85%D8%B5%D8%B7%D9%81%D9%89%20%D8%A7%D9%84%D8%B3%D8%A8%D8%A7%D8%B9%D9%8A%20%20%23%D8%B1%D9%88%D8%A7%D8%A6%D8%B9_%D8%A7%D9%84%D9%83%D8%AA%D8%A8.pdf
             ',
             'book_details' =>'إن الحمد لله ، نحمده و نستعينه و نستغفره ، ونعوذ بالله من شرور أنفسنا ومن سيئات أعمالنا ، من يهده الله فلا مضل له ، ومن يضلل فلا هادى له أما بعد فإننا نضع بين يدئ القارئ الكريم ، ما وجدناه من القسم الثانى من كتاب (هكذا علمتنى الحياة ) وهو القسم الذى بيًضه المؤلف عليه رحمة الله ، ولا نشك بأن قسماً كبيراً قد كان فى جذاذات و أوراق لم يتمكن من تبييضه ، ولم نجده فيما بين أيدينا من أوراق ، ولعلها قد تبددت مع كثير من تراثه !! لأننى كنت قد سمعت منه ، أن هذا القسم يعادل القسم الاجتماعى ، إن لم يكن أكبر منه ، وهو المظنون و المتناسب مع ما لأستاذنا من تجارب فى حياته العريضة المتشبعة',
             'category_id'=> '2',
            
             'image' => 'image/1685019078.jpg',
         ]);  
          book::create([
            'book_name' => 'حكم النبي محمد',
             'author' => 'ليو تولستوي ',
             'rate' => '2.9',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2020/06/95964739.pdf
             ',
             'book_details' =>'حكم النبي محمد: ألف ليو تولستوي هذا الكتاب دفاعًا عن الإسلام في مواجهة التزوير والتلفيق اللذين لَحِقَا بالإسلام والنبي محمد على يد جمعيات المبشِّرين في قازان، والذين صوَّروا دين الإسلام على غير حقيقته، وأتهموه بما ليس فيه.',
             'category_id'=> '2',
            
             'image' => 'image/1685017681.jpg',
         ]);
         book::create([
            'book_name' => ' أنت أيضا صحابية  ',
             'author' => '   أدهم الشرقاوي ',
             'rate' => '4.5',
             'path' => 'https://www.kotobati.com/book/download/78edd60f-1229-439d-bb06-10bfafe1bce8
             ',
             'book_details' =>'نتِ الحضن الحنون الذي نأوي إليه هاربين من مشقة الحياة وأنتِ الكتف الذي لا نستغني عن الاتكاء عليه رغم رقته!

             وأنتِ العكاز الذي لا نستغني عن الاستناد عليه رغم نعومته!
             وأنتِ مصنع الرجال ومهد الأبطال!
             لستِ ضلعاً قاصراً أبداً
             ولا مخلوقاً ضعيفاً يستحق الشفقة
             أنتِ نصف المجتمع
             وأنتِ التي تلدين وتربين النصف الآخركل رجل جاء إلى الدنيا
             كان يوما جنيناً في بطنك يأكل من صحتك وعافيتك
             كل ملك، أو زعيم، أو مفكر، أو ثري، أو ناجح
             كان يوماً قطعة لحم صغيرة بين يديكِ
             كل نبى أنتِ ربيته
             أنتِ صنعتـه
             وكل عظيم انتِ صنعته
             فارفعي رأسكِ عالياً!',
             'category_id'=> '2',
            
             'image' => 'image/1685017654.jpg',
         ]);
         book::create([
            'book_name' => ' ما لا تعرفه عن رسول الله ',
             'author' => '	حازم صلاح أبو إسماعيل  ',
             'rate' => '5',
             'path' => 'https://www.kotobati.com/book/download/026a86b1-2075-4979-b4e7-941b5b394eb5
             ',
             'book_details' =>'
             هذا الكتاب مستخلص من دروسه في سلسلة السيرة النبوية، وهي سلسلة طويلة النفس لا أعرف أحدا من المعاصرين أطال النفس في باب السيرة مثله، فقد بلغت نحو ثمانين ساعة صوتية، وبعضها للأسف لا يزال مفقودا، وما استخلصناه في هذا الكتاب هو دروسه الأولى فقط، فقد بدأ السيرة بمقدمة عن شخصية النبي تناول فيها جملة أمور أراد بها تصحيح صورة النبي في أذهان المسلمين.
             
             ألقيت تلك الدروس في نهاية الثمانينيات وبداية التسعينيات من القرن العشرين، وكان الشيخ حازم في ذلك الوقت في نهاية العشرينات وبداية الثلاثينات من عمره، وهو سنٌّ مبكر بالنسبة لقوة المعالجة لموضوع السيرة ولتنوع اهتماماته فيها، فالعادة أن الداعية يستخلص من السيرة ما كان أقرب إلى تخصصه كأن يستخلص المعاني التربوية إن كان من أهل التربية، أو الدعوية الجماهيرية إن كان من أهل الدعوة والعمل العام، أو الاجتماعية إن كان من أهل الإصلاح بين الناس أو بين الأزواج، أو السياسية إن كان من أهل متابعة السياسة وممارستها.. إلا أننا سنجد الشيخ في هذه السلسلة يطوف بتلك المعاني كلها، مما يدل على اتساع عقله وتنوع اهتماماته.
             
             وهذا الجزء الذي استخلصناه، وفيه تصحيح صورة رسول الله، نحسب أنه من أهم ما ينبغي أن يُقرأ بعناية واهتمام، إذ أن الصورة المغلوطة التي تشربها المسلمون عن نبيهم أسفرت عن تغييبه كقدوة لهم في سائر أمورهم، حتى لقد صار يُكتب صراحة من أقلام محسوبة على الفكر الإسلامي أنه لا يُقتدى بالنبي إلا في العبادات فحسب!!! وأولئك الذين يكتبون مثل هذه المعاني أو يحومون حولها يخطون تجارب سياسية بالغة الضرر حتى بالميزان السياسي المادي العلماني فضلا عن ميزان الدين.
             
             اقتصر عملي في الكتاب على اختيار العنوان، وصياغة الكلام المنطوق في عبارة سليمة حاولت قدر الاستطاعة ألا تفقد روح الدرس الصوتي، مع ما تبع هذا من نقل بعض الكلام من موضعه إلى موضع آخر في حالات نادرة للحفاظ على وحدة موضوع الفقرة، إذ الأمر يختلف بين حديث تدفق الخواطر وبين حديث الكتابة المرتبة التي تراعي التقسيم والتبويب. وكل هذا مع الحرص التام أن يكون التدخل معدوما أوشبه معدوم في كلام الشيخ إلا ما كان في النصوص والمتون، فلربما ذكر الشيخ نصا فشرحه باللهجة العامية أوبَسَّطَه فلم يتلزم بحرفيته، فكان عملي أحيانا هو رد النصوص إلى أصولها.',
             'category_id'=> '2',
            
             'image' => 'image/1685017729.jpg',
         ]);
         book::create([
            'book_name' => '  أسباب زيادة الإيمان ونقصانه',
             'author' => 'عبد الرزاق بن عبد المحسن البد',
             'rate' => '3',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2022/12/Noor-Book.comD8A3D8B3D8A8D8A7D8A8D8B2D98AD8A7D8AFD8A9D8A7D984D8A5D98AD985D8A7D986D988D986D982D8B5D8A7D986D987.pdf
             ',
             'book_details' =>'العنوان: أسباب زيادة الإيمان ونقصانهاللغة: عربيتأليف: عبد الرزاق بن عبد المحسن العباد البدرنبذة مختصرة: كتاب لفضيلة الشيخ عبد الرزاق بن عبد المحسن العباد البدر يبين فيه أسباب زيادة الإيمان ونقصانه فى ضوء الكتاب',
             'category_id'=> '2',
            
             'image' => 'image/1685019062.jpg',
         ]);
         book::create([
            'book_name' => ' حكم ومواعظ ',
             'author' => '  عبد الحميد رميته  ',
             'rate' => '4',
             'path' => 'https://www.kotobati.com/book/download/2fb97dfa-61eb-4ce7-b67b-61f60f99b84b
             ',
             'book_details' =>' هذه باقة من الحكم والمواعظ , ومن النصائح والتوجيهات , ومن الأقوال المأثورة ... جمعتها من هنا وهناك ... خلال حوالي عام كامل ... جمعتها من كثير من الكتب والمجلات , ومن الجرائد الدينية والفكرية العامة .
             • هذه مئات من الأقوال المأثورة ومن الحكم الغالية ومن المواعظ المؤثرة للغاية ... جمعتُها لنفسي ثم فكرتُ بعد ذلك في طبعها ليستفيد منها غيري .
             • مهم جدا لو يحرص كل واحد منا على أن يخصص لنفسه وقتا كل يوم أو كل أسبوع أو ... ليجلس جلسة إيمانية يقرأ من خلالها جزء من هذه الحكم والمواعظ ليقوي إيمانه بالله , وليزيد من أجره عند الله , وليتذكر الله واليوم الآخر , وليجدد العهد مع الله على التوبة والطاعة .
             • هذه الحكم والمواعظ يمكن جدا أن يستفيد منها الرجل والمرأة , المثقف والأمي , الكبير والصغير ... اليوم وغدا وإلى يتوفى اللهُ كلَّ واحد منا [ اللهم ارزقنا حسن الخاتمة ].
             • ومع هذه المقدمة أجد نفسي مضطرا لأن أعترف ... الصراحة تقتضي مني أن أقول بأن الجزء البسيط فقط من هذه الحكم والمواعظ هو من إنشائي أنا , ولكن الأكثر كان نقلا عن علماء ودعاء , وعن شهداء وصالحين , وعن مفكرين وكتاب و... وكانت مهمتي مع هذا الذي نقلته هي فقط الاختيار والانتقاء ووضع القول تحت العنوان المناسب مع محاولة تبسيط اللغة حتى تكون في متناول أغلبية من يقرأ هذه الحكم وهذه المواعظ .
             إن أصبتُ فمن الله والحمد لله , وإن أخطأتُ فمن نفسي ومن الشيطان , فأستغفر الله',
             'category_id'=> '2',
            
             'image' => 'image/1685017670.jpg',
         ]);
      

         Book::create([
            'book_name' => 'العواصف',
            'author' =>'جبران خليل جبران',
            'rate' => '3.90',
            'image' => 'image/1685019256.jpg',
            'book_details' =>'يتحدث جبران في هذا الكتاب عن الحياة والموت والحب، بمنطقيةٍ فلسفية مُزْدانةً بديباجة أدبية؛ فهو يستنطق بفلسفته ألسنة الأزهار والأشجار لكي يُفصح من خلالها عمَّا في هذا الكون من أسرار. وقد قسَّم جبران في هذا الكتاب كلمة العبودية وفقًا لدور الأشخاص في تمثيل العبودية على مسرح الحياة الإنسانية، كما وصف حال الشرقيين وجسدهم في صورةٍ تُظْهِرُ خنوعهم وتخاذلهم، واصفًا الشرق بأنه المريض الذي تناوبته العلل وتداولته الأوبئة حتي تعوَّد السَّقمَ وأَلِفَ الألم، ويدعو جبران للخروج من هذه الحالة الحضارية من خلال تمجيده لقيم التمرد والتحلي بروح الفرادة بدل من الانسياق وراء التقاليد بشكل أعمى.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeTfXoyqMTlKHEbaP7uEHIqGtVqzd-Wcqk6jlEg2DaN9SRHpksCTpnVih3SOmEVbCATBSJrwZEFzlrzMu-7hqoHxI7SuyDNcfxPck3-BFEIaA-Yis2bZajWjXFxt1I59gQSqHserpsGvy3__13jLG3inSpxTB0vxiBQvyeOI5gpiDz_8M2H9A_aAGPxwIVho8kgDlp36HQQEIDae8-O7MWytkQO9uoDjyRJHaVY1JBlCMqv4Brr2RRAIkZ54xrIczVm0cNx',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'غاية الحياة',
            'author' =>'مي زيادة',
            'rate' => '3.36',
            'image' => 'image/1685019272.jpg',
            'book_details' => 'يسعى كلٌ منَّا في حياته لتحقيق غايته المرجوة، وأهدافه المنشودة، يدخل معترك الصراعات ويخوض غمار الحروب لتحقيق هذه الغاية، وعلى اختلاف دوافعنا، ومعتقداتنا، وأفكارنا، نسعى جميعًا لغاية واحدة، وهي: «السعادة»، السعادة التي حُرمها الناس طويلاً، فازدادوا شوقًا إليها، وإصرارًا على المواصلة لتحقيقها. والسعادة في حقيقتها هي تطور متتابع نحو حالة تكتمل عندها كلُّ القوى كاملةً وافيةً بأقلِّ ما يُمكن من المقاومة والألم. وليست الفاجعة في عدم بلوغ هذه الغاية، إنما الصعوبة الموجعة هي عدم وجود الغاية، وكاتبتنا المبدعة هنا «مي زيادة» تخاطب المرأة العربية في هذه المحاضرة، وتعايشها آلامها، وتحاول أن تصف لها الدواء ببثِّ روح جديدة في عروقها، وحثها على البحث عن غاياتها التي أضاعتها وهي أقرب إليها من أيِّ شيءٍ',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaer8nzkw8YR9usE-fcnFjV0wyp7mGqZlKCOAccJpqIZASeDt2_G7xbXRMylNPYUN0IG8HDDfOcliQ7cXnFGF-sfaEHYS2mzGC-WzJAk19fEkRP736KSaowKFD9QWK1fTA1JI4XaMhYEO86ruXKueXfJl7J2TIa48x20rQVilFF3XQdrlAVuqEJNUR0mISITCa4ZdIwbFZPOeurexFIYKWj5r4NsaR7NAnicfvtAGy6nlZSWLlEuAwOtCdAUkew2jw3-HHn1o3e6lql703e6G0fZFHd2iw',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'ماجدولين',
            'author' =>'مصطفى لطفي المنفلوطي',
            'rate' => '4.4',
            'image' => 'image/1685019283.jpg',
            'book_details' => 'الحُبُّ هو ذلك السلاح الذي يقضي أحيانًا على آمالنا، وربما على حياتنا. هذا هو محور الرواية التي تدور أحداثها حول وفاء «استيفن» لمحبوبته «ماجدولين» التي لم تترد كثيرًا في بيعه بالمال؛ فتزوجت من صديقه «إدوار» الذي كان يقاسمه في المأكل والمسكن. ويتبدل الحال وينتقم الدهر؛ فيفقد «إدوار» ثروته وينتحر، تاركًا زوجته فقيرة ومدينة، بينما يرث «استيفن» ثروة كبيرة. وتشعر «ماجدولين» بالذنب؛ فتذهب لحبيبها السابق معلنة ندمها وتوبتها، غير أن كرامته تسمو فوق حُبِّه؛ فيرفض توبتها، ولكنه يساعدها على تجاوز أزمتها المالية. ولم تُطق « ماجدولين» الحياة فتنتحر، ويدرك «استيفن» أن قلبه لا زال نابضًا بحبها فيودع الحياة غير آسف. وكانت آخر وصاياه أن يُدفن بجوار حبيبته؛ وكأنه يقول للقدر إن أبيت أن تجمعنا فى الحياة بأجسادنا فها نحن مجتمعون بأرواحنا.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacQ2Q5sD9reMmFuSnjtvwGWr_EHqalAY8N9qzRHiWoEJMMY7QoLfEgyLmK2tpxMISUg9dVpB2wDaiP8MjjBWtR9kwZDxD3UQuJxGOrk1R6qSoQA-FdA3Iks5-XtlPqcCgxAcL3nQrhbgGgojYk7eE2yU5zRkJPZGm4NtTIW-IGtgwzrFr-HrkIi2pmuXu-QALD9Di-BLF5L6k9nonhLIwEy0D2xZpcXog5x_HVcYadsZ0pDhyDtVJBGp-DdKS5mffUiiUFb',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'البدائع والطرائف',
            'author' =>'جبران خليل جبران',
            'rate' => '4.0',
            'image' => 'image/1685019436.jpg',
            'book_details' => 'يضم كتاب «البدائع والطرائف» مجموعة من المقالات الأدبية ذات البُعد الفلسفي والصوفي التي تتحرى مواطن الجمال سواء في الفكرة أو في الكلمة التي تعبر عنها؛ فيحلل النفس الإنسانية إلى عناصرها الذاتية، ويتخذ من كلماته مرشدًا لتلك النفس التي يدعوها إلى عدم الأخذ بظواهر الأمور دون الاستنادِ إلى جوهرها. ثم ينظر إلى وطنه لبنان برؤية شاعرٍ يجسد الجمال لفظًا فيما يحب، بعيدًا عن رؤى سياسية التي تحكمها لغة التناحر والصراع. ويتناول كتابه أعلامًا أضاءت مَفْرِقَ المشرق بعلمها: كابن سينا، وابن الفارض، والإمام الغزالي. كما يتحدث عن مستقبل اللغة العربية، وأبرز التحديات التي تواجهها في ظل رحى الفكر الدائرة بين القديم والجديد، ويُنْهِي كتابه بعدد من القصائد الشعرية التي تنطق بفلسفته الروحية.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaca9mvxa-qr3996WAUG7ZA1nxiQpMHWFZy3FIUkACFYgzEO3rVLNoRWh5b9vTInqS_sJbgF7u-bNXZ0CUFUborOGiIU_ZemXjp61AfKJfpl4plfQdikI-QoxxFS07MZiDzaAGCpjmCjkSy9EO-KyXJP8Hl7O3jnkhyFpX9wrbCtrVdc954d9PkHMSo6s7OYe89ydiby7GZ86iDhOUG8Fk6kk258pXUHAU3b9X5zX5fzVGrMQp4rb6F7zbFoFhWwSczd23N-GoOTbDcgUjBp1yXT33KoMQ',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'ضجة فارغة',
            'author' =>'ويليام شكسبير',
            'rate' => '3.9',
            'image' => 'image/1685019369.jpg',
            'book_details' => 'يخلط شكسبير الجِد بالفكاهة في مسرحيته التي استقى مادَّتها من رواية «سان تمبريو» الإيطالية التي دارت أحداثها في ميلانو، وقد اقتبس منها فكرة الغدر السائدة في القَصص الإيطالي التي جسدها «دون جون». ويجمَعُ شكسبير بين المتناقضات في مسرحيته، فيمزجُ بين المأساة والمَلْهَاة، كي يُبرهِنَ على عُمق المأساة الأخلاقية والإنسانية التي تعرّضتْ لها بطلة القصة، وهذا ما عَهِدناه في كتابات شكسبير؛ فهو الكاتب الذي يمتلك منطقية الفيلسوف العقلية، ومَلكة الأديب الإبداعية، وقد اتَّسمتْ شخصياته بالثقافة العالية، والبراعة في صياغة دليل الإدانة الذي يضع البريء في ساحة الاتِّهام.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacCCH9M6o89QbEpAcTCI4m5gEn2mFoM0ZvZR6Q39SIwgq2f39wlkT4VTefvZRYN4lX-Co-U-_NYEhA6p9Ih_S6HZ2gI-PK4_bNgVutKoNQI2_9Y7KWa8yCtBCIQ2xSfUKxKI78A24aBn0pJMIhHBtT743qvQHx_eXAri9UoFadwLdOdjTYKCLbVvjE3jSDRVECOWCEmQFEJmZnbfWpt3sqjp30kuYKnwwAqPjMvFXbnsle2AZT_DNovKOnPvw6bbJXfvnDI',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'دمعة وابتسامة',
            'author' =>'جبران خليل جبران',
            'rate' => '4.5',
            'image' => 'image/1685019354.jpg',
            'book_details' => 'إن لكتاب «دمعة وابتسامة» مذاق خاص في ألسنة قارئيه، فهذا الكتاب بمثابة أول نغمة من نوعها في العالم العربي الحديث، فقد خالفت تراكيبه ودقة بيانه المألوف آنذاك في الكتابة الأدبية العربية، وقد جاء الكتاب كتمهيد لحركة عربية رومانسية جديدة، ابتدعها جبران خليل جبران، واستطاع من خلالها أن يقدم لنا لونًا جديدًا من ألوان الأدب، تطرب لجمال لفظه الآذان، وترقى لجلال معانيه القلوب، وتذهل لروعة خياله العقول.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacAnO2FRqyDzsZLyngj-T6TPuCy64my8b8XPASSMp7IT1Elb0SqjeoL2ewThwG2GnLjz7gotQl4ETVt9mjkx8tzpn4JW0y3YqchmpsfymiBldYt3als5iJ-nV469mT_Hy8PYuhqN75r1ZuvBnyjmmaXgkRqdGaeOebNCmcREncgRgL9MYt8Y52_wHP5TB60XdLVRBfh6bodzuNEUHRO_IKumjpgvGT43j1TzlvUsoYfzbGV1hh5_b6sB0FsHitWHSpe_thRrV2H_FU5MqHvWR1o5cyNxQ',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'حديث القمر',
            'author' =>'مصطفى صادق الرافعي',
            'rate' => '3.7',
            'image' => 'image/1685019453.jpg',
            'book_details' => 'استلهم الكاتب من شخصية الفتاة اللبنانية التي عشقها وحي مناجاته مع القمر، وأراد أن يُعَلِّم الطلاب فن البلاغة والإنشاء من خلال تلك المناجاة. فالكاتبُ في هذا الكتاب يُنْزِلُ القمر من علياء السماء كي يرى فيه صورة المحبوبة بأسلوبٍ يفصحُ عن نفيس الدر في فن الإنشاء؛ فهو يتخذ من وجه القمر آيةً يُفَنِّدَ فيها دلائل الإعجاز الجمالي في هذا الوجود الرباني. فيستنطِقُ بحديثه مع القمر لسان الطالب ببدائع اللفظ الإنشائي، وقد وفِّقَ الكاتبُ في اصطفائه للقمر؛ كي يرسم على صفحته إبداع الخالق ويستقي من جماله القيم الإنسانية والأخلاقية والدينية. وذلك لأن القمر الساكن في أفق الليل هو خير صديقٍ تُوْدِعهُ النفس آلامها وأحزانها.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafHNiJoNFQRXtzmmoq_dX4CMKcGLMA03hNKr94XPGwp52BR_aN5th3tKckSGW8Hxedq2R-_Wm4lWSwTFrg-MZMN3ulzO0WwjN2X95N1DtRDB8-QmpI_53WSkDkXIonnIzt6lyYfdrdXVAAEi00gZhDRSDJjpLFPCMW3k20ejDZ7Kmbog05esCaB4z0Xo8IQBxabOyoqLaI5RWuylm44M2MmsXkA2LdaKPr-G4PPziSj4_vIsaGY3-YCLd5A4ioSW1qpGxau',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'بدائع الخيال',
            'author' =>'ليو تولستوي',
            'rate' => '3.79',
            'image' => 'image/1685019465.jpg',
            'book_details' => 'يجمع هذا الكتاب مجموعةً من القصص القصيرة المختارة من أعمال الأديب الروسي «ليو تولستوي»، والذي يعُدُّه البعض واحدًا من أعظم كتَّاب الرواية في الحضارة الإنسانية. وتتوالى عبر الكتاب قصص قصيرة تعبِّر عن التنوع الظاهر في أعمال تولستوي، وذلك من جهة الموضوعات التي يتناولها بفنِّيَّةٍ ومهارةٍ لا تتأتى إلا لمن أنفق الكثير من عمره في معرفة الناس والمجتمعات وأخلاق أهلها، واجتمع له من التجربة الحياتيَّة ما يستعين به على إدراك الواقع وتحليل حوادثه، ومن القدرة الإبداعيَّة ما يمكِّنه من نقد الواقع وإرهاصاته مُقوْلبًا رؤيته للمستقبل في قالبٍ أدبيٍّ شديدِ التعقيد كالرواية أو القصة القصيرة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadVAMwXmHE150M6MSKCoZRjO0u_se6JwjmjlihDSr0a-UjPUE8ogsKcMIiU-wgZtycIAJPKtvkWL4RIJ5zbXusY0te6qeVkROt2va5vh54Bj4UrnvYIyzbsr7fptW96HgCJm8-vDlPP-iLkijUkVBxe4QNq8byS__TjtgGUIkJB_Qhiw2lZSOmSBF8udNPUX7uVqnoo0MTnVNkUzaHyvrec7sjmU0we6HWqetBQjboEk5SiH9OT0XbVVfBPUaXH-NczdXDJUgc3gmdib7QWBAqaUh2dGg',
            'category_id' => '3',
        ]);
        Book::create([
            'book_name' => 'حضارة العرب',
            'author' =>'غوستاف لوبون',
            'rate' => '3.89',
            'image' => 'image/1685019102.jpg',
            'book_details' => 'يؤرخ لنا هذا الكتاب مجد العرب التَالِدِ الذي يضرب بجذوره في عمق أزمانٍ كان فيها العرب فرسان الحضارة الذين أضاءوا العالم بأمجادهم. ويوضح لنا هذا الكتاب الأقسام التي انقسم إليها العرب، والأمجاد التي حققوها عبر العصور المختلفة، والمبلغ الذي وصلوا إليه في مختلف العلوم والآداب، والفنون، وسياساتهم الحربية، والأدوات التي كانوا يستعينون بها في إدارة رحى الحرب، والنقود التي كانوا يستخدمونها عَبْرَ العصور المختلفة. وقد ذكر الكاتب طَرَفًا من أخلاق العرب وعاداتهم ومكانة المرأة عندهم؛ لِمَا لها من دلالة على رقيِّهم وتقدمهم، وقد برع الكاتب في الكشف عن أوجه هذه الحضارة، فذكر تفوقهم في الزراعة والصناعة والتجارة. ويمكننا أن نصف هذا الكتاب بأنه جاء كاشفًا عن مكنون الحضارة العربية، جامعًا لعلومها، وفنونها، وآدابها.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadQgKIHS2k9fvOXDi2gQ9GcfBdu5BEiuIpzuM2PwBGbFjAmcXqwzvWsS0s0WmIAAsGojwg9pBjVDqkmToxXIbVAaJUuaDHZ_x-psrr6q7D24bwnixBHsgO_ce-vlvDOr6eH8uhQFQdan8dQFGoyp7ZYihsE-7ZjqSlBGIMT9YVQngbh1vD9jvfjARo0f7k4qFz9OvX71LKJRdN29CG2xNRuIPJuhIenU6SwlalmiOfMv-U-65uPzWmEG39RLb4s5IOiOmhytVgifD2_f31WJAagCvk5pw',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'عبقرية عمر',
            'author' =>'عباس محمود العقاد',
            'rate' => '4.18',
            'image' => 'image/1685019113.jpg',
            'book_details' => 'يزخر التاريخ الإسلامي برجال عِظام سطروا حوادثه الكبرى بحروف من نور يشع من صلاحهم ونفعهم للناس، فحُقَّ لهم خلود الذكر. من هؤلاء «عُمر بن الخطاب» أحد كبار صحابة النبي، والخليفة الراشد العادل، كان دخولُ عُمرَ الإسلامَ نقطةَ تحوُّلٍ كبرى في حياته؛ حيث ظهر كرجل قوي الشخصية حاسم الرأي طالب للحق، أعز الله به الإسلام فكان ظهيرًا لإخوانه المسلمين ضد ظلم الجاهلية، فيصاحب النبي ويخدم دعوة الإسلام بكل طاقته، ثم يصبح خليفة المسلمين بعد وفاة الخليفة الأول «أبي بكر»، فيوطِّد أركان الدولة الوليدة ويوسِّع من رقعتها، كما يرعى مصالح أبنائها في عدل لا يخلو من الرحمة. وهذا الكتاب هو دراسةٌ لجوانب شخصية عُمر وطِباعه النفسية وتعرُّفٌ على مفاتيح شخصيته، لنفهم هذه الشخصية العبقرية أكثر.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaf6psspiAmimUlrXrJG4cn316MjdhGw6QjSqsHrDzUmTHjPYOPxoFg8UYO1UcXGDW5GxNQWXBRY26OHvz6E0a8ofuHnURcUNG11P7A6q9qQAczueJejNy-xrPQ_GrON_pLo6JBkIwJZiRM4OyCXz3vYUjlOQ7n6DIJmeabuN74hBzUHgBLO_LspeXZ28qRUvQUxYKSlrVO11eKJx3QcLnp1jnmQ5GFwpo_03DyS7zdplywNiCu_APWjvas39Rf97zjAaqYC',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'المرأة في الجاهلية',
            'author' =>'حبيب الزيات',
            'rate' => '3.28',
            'image' => 'image/1685019125.jpg',
            'book_details' => 'هذا الكتاب هو واحد من الكتب المعنيَّة بعرض وجهي العملة؛ فالصورة السوداويَّة التي تمثُل عند الحديث عن وضع المرأة في الجاهليَّة، يقابلها «حبيب الزيات» بالكشف عن صور من رفعة منزلتها وصيانة جانبها. ومن هنا يركِّز المؤلف على فهم طبيعة ذلك المجتمع القديم بأمزجته المتباينة، فحياة البداوة وإغارات القبائل بعضها على بعض، والتي اقتضت وقوع النساء في الأسر، لم تقتضِ استسلامهنَّ المطلق للعيش سبايا، بل كنَّ يكافحن للفكاك. وكما ساد شعورٌ عامٌّ بكراهة البنات، وعَمِد بعض الرجال لوأد بناتهنَّ خشية الفقر والعار، فقد كرَّمهنَّ آخرون وأحبوهنَّ، بل وذهب بعضهم إلى افتداء الموءودات بدفع الأموال لآبائهن. ويشير المؤلِّف كذلك إلى المكانة الأدبيَّة للمرأة العربيَّة التي لم يخلُ مطلع قصيدة من ذكرها والتغزُّل بها، فضلًا عن إسهامها في إلقاء الخطب الحماسيَّة وقرض الشعر الرشيق.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacX24lsCSNyLG0rhvDGkBv6x7UIlUoEmkHUgIY93jtJ9k5Pxai5PaSaqLTAC16tSQfMbSL6Zo2Hlwd_EL4-nNWgFtNbbae025lSh16ndX10-vbUC9CQL1NwAaYTuBej2YELgi2fvv_q58clHkDmYAVG1WJquRXxytrqEgN_NaxWawST-n3oh0yu5VEZEWRKGcaLyAhobLqBX2mmq_C02JlwntNy0pyYcHzhDD8T2Sq7vEWQ28yx-GSuQO1F4ml9h816xDvBzN5HFyHuFje5yh6hVezmZA',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'حياة محمد',
            'author' =>'محمد حسين هيكل',
            'rate' => '4.33',
            'image' => 'image/1685039001.jpg',
            'book_details' => 'كتب العديد من المؤرِّخين قديمًا وحديثًا عن سيرة الرسول محمد صلى الله عليه وسلم، ولكن يبقى كتاب «حياة محمد» لمحمد حسين هيكل، من أبرز الكتب التي كُتبت في العصر الحديث حول هذه الشخصية التاريخية والدينية العظيمة؛ ففي هذا الكتاب يستعرض هيكل تلك الفترة المفصليَّة من التاريخ البشري، بأسلوب علمي راقٍ خالٍ من التعصُّب والتحزُّب، كما يحرص على عدم مجاراة السرديات التاريخية السائدة في عصره والمتمثِّلة في اجترار مناهج القدماء، فقد حاول بدلًا من ذلك أن يغيِّر منطلقاته المنهجية ليعتمد على أساليب البحث التاريخي الحديثة للاقتراب من الحقيقة التاريخية أكثر؛ حيث أسَّس رؤيته انطلاقًا من الاستقراء والتجريب والملاحظة، واستعمل العقل بجانب النقل، وقد أثبت هيكل بحقٍّ من خلال هذا العمل الرائع أنه مؤرخ قدير وعالم جليل.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeMRLAkEpybVCt8vJNID5cCoWpicXxavLP10w5zkPe3Wkr4cK7TdJansjA20CMk4ZW443w0u4pz7SpfsRKoCV5hlWtT7EV7KUbjcWMb-cJX2OXr3T-OlixHV6th5886xSCRdaCMbuPNsGAuCBKyUGqofGWhXWImfKu4l8r8VmReETt75xmGe5OC-z-7xpIhK5Zb0M9O1KoiOOI5tw2dMzXlwYEca6z0LeZlHLhMaFbVmirG6coYYyFysORO2IRcRGwo2ZfN',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'قصة العرب في إسبانيا',
            'author' =>'ستانلي لين بول',
            'rate' => '3.78',
            'image' => 'image/1685019183.jpg',
            'book_details' => 'أكثر من خمسة قرون مضت منذ ضاع الفردوس، وانتهى الوجودُ العربيُّ في تلك البقاع الإسبانيَّة التي شهدت فتراتٍ من الإشراقِ والتألُّقِ الآخذِ بالألباب، شاغلِ الناس قديمًا وحديثًا. وبقدر ما يتَّفق العالم غربه وشرقه على عظمة الحضارة الأندلسيَّة، وجلالة منجزاتها المعماريَّة والفنيَّة والعلميَّة، بقدر ما يثور الكثير من اللَّغط حول تاريخ الأندلس، فيتناقله عددٌ غير قليل من المؤرِّخين مضطربًا ملتبسًا، ويندر أن نجد تآريخ حياديَّة، تُصوِّر الحقائق كما كانت، دون تفخيم أو تحقير. ومن هنا يُعدُّ وقوع مثل هذا الكتاب بين يدي القارئ ضربًا من ضروب الإمساك بالحقيقة كما بَصُر بها المستشرقُ الإنجليزيُّ المُنصِف «ستانلي لين بول»، والذي أتاح لنا الوقوف على الصورة الكاملة لتلك الحضارة التي سطع نورها قرابة ثمانية قرون من الزمان، وما زالت عجائب أخبارها تتردَّد حتى الآن.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadFYhAzwQrI2eSr6SN4vqqyPoam7iikao9UfyyefEjc7fLwoCMTFtlJIdghYn2nhRL6uRSOa6JTuQjQ8YI3TP4t3hleF4kwJ7b5l62puBi69ZyMq3Q7PpENKITMF4NJUYPiv3AykKHxr1EAAU39SNl0rPcM8c2Ha44tQxz2dRDts8W31zMu81fgXzNNAwySV0nVvT_V6W3ax6g0qRBR0axx9BaC7Q74jMSBf7HbatkILjaxH3mZVI5wpsZDSe9VRepk-NFtEx0Z9tExGjnUYF-BLIhu-WnDkc6td2m2BrMvnIFLKbQ',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'أشهر الأمثال',
            'author' =>'طاهر الجزائري',
            'rate' => '4',
            'image' => 'image/1685019176.jpg',
            'book_details' => ' «وإنَّك لأصنَع من النَّحل، وأطْيَش من فراشة …» إن مِثل هذا التعبير الدارج في عصره قد يُعَدُّ محض مجاز أُريدَ به وصف حالة، إلا أن المهتم بالتراث وخباياه سيرى فيه أكثر من ذلك بكثير؛ فبين البحث في مبنى الكلمة ولحنها، وبين استنباط الكثير عن قائلها من وصفٍ لإنسانيته وعلاقاته وأفكاره؛ ستجد مرآةً لمجتمع بأَسْرِه في جملة واحدة على قدرٍ عالٍ من البلاغة والتكثيف. وإذ كانت «الأمثال» فنًّا أدبيًّا فلكلوريًّا مهمًّا، فقد عمل الباحثون في تراث الشعوب على توثيقها، وكذا كان الحال في شأن الأمثال العربية؛ فنجد العديدين ممن حرَصوا على تجميعها وتصنيفها والاستنباط منها، أمثال «أبي الفضل الميداني» و«الزمخشري» و«طاهر الجزائري» مؤلف الكتاب الذي بين أيدينا، والذي جمع فيه عددًا من الأمثال الدارجة وفهرَسها، وأفرد مساحة للحديث عن فوائدها وعلومها.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaf3a9OkMdJ86LGvnwtUk-aKS-VW0sZFTjy_4mKY2vQ00P1WZf-dVKGVqg_DPHnbKQ0knQoKKoLWRIK9LucEjKvHC3OdIh5TFNZE1N-0jUuFtFrF75IdA6tS9lWvQojDGyS96LSdpmZw84N22bZTbzX7ZzNidNS9SkHzkYYK05MPMT1bwFzDPVTTIVxKtCKGR5ICO2urSQJb5W-Q0YQwabaI3r9-BScfTjav5X7OfJOXH60pCPfBmNvR-6C6D6A4kNrLZDEMETF00jCTCm25LAOseHasCA',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'عصر العرب الذهبي',
            'author' =>'فيليب دي طرازي',
            'rate' => '3.09',
            'image' => 'image/1685039038.jpg',
            'book_details' => 'لقد بلغت الأمة العربية والإسلامية من النهضة العلمية في «عصرها الذهبي» مبلغًا وصلت لأمم العالم جميعًا أخباره، ونهلت من علومه وفنونه. في حين كانت نهضة الأمم وحياة الشعوب موقوفة على ملوكها وحكامها، بنى العرب نهضتهم مستندين إلى تاريخهم ولغتهم ودينهم، فنبغوا في الطب، والفلك، والهندسة والرياضيات، والفلسفة، والرسم، وغيرها من المعارف، وأسسوا لكثير من العلوم، بجانب عبقريتهم في الأدب والشعر والترجمة، فغدوا أعظم الأمم، وأنفعها للعالم، وأراد الكاتب بهذا العصر هنا عهد الخليفة العباسي «هارون الرشيد»، والتي أضحت دولته في ذلك الوقت تضاهي ممالك الفرس والروم في عزِّها واكتمال شملها.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeXmd-qVXvnuJeBLhxRlvrRunNYIHaG2y_oLDbMP4iLJEacAMGfok6JYvSH-1rx59kIVdzr9V4n3rIzVUHyPp492iBIcuF1feRiULSMx6AiTYAzeRMWuxo_eOWTdOlAdHMVROHDn8XjjHBspEBejc7NxFmXrRsLJwiO0wI_G770zxcZyOm_bvuC2yPj40nC5bDDTJrPvzXu1nd8VCnBzIrI7fn5bL7nFXiSIsEf02-4zTYCQbRmmyxtCegG5knTCZRSQm1OSfm3S7mhxBRwVV6VLO-4vA',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'الحب والجمال عند العرب',
            'author' =>'أحمد تيمور',
            'rate' => '3.40',
            'image' => 'image/1685019221.jpg',
            'book_details' => 'يتضمن هذا الكتاب لمؤلفه أحمد تيمور الكثير من الآراء والأحاديث والنوادر والأشعار التي دارت حول الحب والجمال، حيث يستعرض الكتاب صفات الحب وأغراضه وأنواعه، ويتناول مختارات وطرائف مما قيل في العشق والجمال والغزل، كما يشتمل على نوادر فائقة للشعراء العشاق. ومن الجدير بالذكر أن تيمور باشا لم يستثن أحد من هذا الموضوع، حيث تطرق إليه عند الأنبياء والخلفاء والشعراء والسلاطين والفقهاء والمتصوفين. وليس من الغريب أن يبدي رجل بقامته وهو الأديب والعالم والحجة في اللغة إعجابه بالحب والجمال على الرغم من اشتهاره بالوقار والمحافظة على التقاليد الدينية والاجتماعية، فقد سبقه الكثيرين من أكابر العلماء والأدباء ممن عنوا بذات الموضوع.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafX48yS2ybLoQNlkK2AOgsU8MbNhCj07-fsKAJqhaehGqX2ySShQt1-ugBkDx-f6N5zT-Td-VF2DUdzUQsPCZi_YLlIeKKi3r15KJZxAouFlpPAQGxlk3J7zN-xGvUQZKPvRq7mz-d1bMFqg9tNPy0GQjvPnQQ6Mwu8zWzKsZveBSiuF7UpF2DIy4PDwS7Myr2Oi-X4n-o_rR-o4uwE9S5htFFxkpfBxu53enZh9ipQ3Crz_y5HhWSd3ulxADJdscDCTfYkgZmLxpyZPJo8QtYN8Aio-KReRiKD0e4D0JT0n8hKym4',
            'category_id' => '4',
        ]);
        Book::create([
            'book_name' => 'رحلات الفضاء',
            'author' =>'مايكل جيه نیوفلد',
            'rate' => '3.77',
            'image' => 'image/1684689862.jpg',
            'book_details' => 'تاريخٌ موجز لرحلات الفضاء، يبدأ من الصواريخ العسكرية، ويمتد عبر «سبوتنيك» و«أبولو» والمَركبات الروبوتية وثقافة الفضاء، ويصل بنا إلى رحلات الفضاء المأهولة.

            تُعد رحلات الفضاء أحد أعظم الإنجازات البشرية في القرن العشرين. في البداية، أطلق السوفييت «سبوتنيك»، أول قمر صناعي، في عام ١٩٥٧؛ وبعد أقل من اثني عشر عامًا، هبط رُواد الفضاء الأمريكيون على متن المَركبة «أبولو» على سطح القمر.

            يوضح المؤلف أن «برنامج الفضاء» ينبغي ألا يُنظر إليه باعتباره مكافئًا لرحلات الفضاء المأهولة؛ فمنذ الستينيات كانت المَركبات الفضائية العسكرية والتجارية غيرُ المأهولة تدور حول الأرض، والتقطت مَركباتُ الفضاء الروبوتية التي استكشفت الفضاء العميق صورًا مذهلة للكواكب البعيدة. يبدأ المؤلف كتابه بأصول رحلات الفضاء واكتشاف إمكانية الاستعانة بعلم الصواريخ في هذا المجال، ثم يناقش سباق الفضاء السوفييتي الأمريكي أثناء الحرب الباردة، ويتناول تدويلَ رحلات الفضاء المأهولة وخصخصتها بعد الحرب الباردة، والتأثيرَ الثقافي لأفلام الخيال العلمي التي تتحدث عن الفضاء، ومنها «ستار تريك» و«حرب النجوم»، والسياحةَ الفضائية لذوي الثراء الفاحش، ورغبة الناس في الذهاب إلى الفضاء. وسواءٌ تَمكَّن الجنس البشري من العيش في كواكب أخرى — كما يتوقع البعض — أو استمر في اعتبار الأرض وطنه الأم، فإن هذا الكتاب يُعد تمهيدًا يستحق القراءة',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacT6AI1GBSag9wtAGnGDD8WAICANaY3fDklAdsZAb0T-9FL5pSyXt6L3ayOiWjurnJACXJpbmISjAMog3C5NjKwrzzUW75Ot8JZiC4wBv6bHHyfpZSdtt-4tBQms-siiRGGN5crXoaBdNGpG0xNQOewlj83gVkLTsGfoZoT7kGENQRvrLgbn1M9j-LFNnLX7beN3k6toHtnaQY4pcYsefBmFNDOBFLLs0ukQXIrBe9uxNBwmNk3hCyCsvWBlISMnWiuWNDiz_S6ttKwWtXzr1uvl9ZSsg',
            'category_id' => '5',
        ]);
        Book::create([
            'book_name' => 'وداعا نظرية مركزية الأرض: كوبرنيكوس ودورات الأجرام السماوية',
            'author' =>'ويليام تي فولمان',
            'rate' => '3.17',
            'image' => 'image/1685040152.jpg',
            'book_details' => 'حين وضع كوبرنيكوس الشمس في مركز الكون أحدث ثورة قلبت علم الكونيات في عصره رأسًا على عقب، واستهل مسارًا علميًّا جديدًا من الفكر قاد إلى فهم جديد تمامًا للكون ولمكان البشرية فيه. يقدم لنا ويليام تي فولمان بأسلوبه الأدبي المفعم بالحيوية وبذكائه المتقد شرحًا جديدًا ومستنيرًا ليس فقط لأفكار كوبرنيكوس وكتابه الشهير «عن دورات الأجرام السماوية»، بل أيضًا للعصر الذي عاش فيه والصراع الملحمي الذي دار بين الاثنين.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadNjGVzzRh3s5YWq4FeQWZmURLEzzI4gtUpjl12tVQV07NuW2Ib0yL_gzUFRK4J5mBINphvgGuowQwbO2SJeV5nzOoNr7CmWYqaDE5fagy6vc8ic2zk427aex5wXgZ94SOdp3eOkcvNNEtsxIn3Hwmr7KSjE2VovxaF5v2ln6iDS_vxxKNr8S6lNnMJIaqIRK4_lxCJ80ZVSsxLB_eWm3NxSnF81i-mkvYLmTULm5o5HiZ-z3UBowFoWx-IOjuqotFPD4TYktrTXMb3eSzZjmzDlKCKBXArCHjJF46_hORanaVB89g',
            'category_id' => '5',
        ]);
        Book::create([
            'book_name' => 'الذرة والقنابل الذرية',
            'author' =>'علي مصطفى مشرفة',
            'rate' => '3.97',
            'image' => 'image/1685040235.jpg',
            'book_details' => '«الذرة والقنابل الذرية» واحدة من القضايا الشائكة التي تشغل العلماء، والمشتغلين بالسياسة الدولية؛ باعتبارها مأساة تؤرق العالم، ويتناول هذا الكتاب كل ما يتعلق بتركيب الذرة، والعناصر التى تتألف منها، والأشعَّة التي تُسهم في تكوينها، ثم يتطرق بعد ذلك إلى الحديث عن النواة، والبحوث العلمية التي أُجريت حولها، وكيفية الاستفادة من النواة في مجال توليد الطاقة الذرية، والدوافع العلمية التي أدت إلى نشوء فكرة الطاقة، ومدى وثاقة العلاقة بين الطاقة ومدنية الأمم، وفي نهاية هذا المُؤَلَّف العلمي النفيس يتطرق الدكتور مشرفة إلى أهمية اليورانيوم في مجال الطاقة النووية، ثم يشير إلى أن الطبيعة الجيولوجية المصرية مؤهلة لاكتشاف هذا العنصر الهام على أراضيها، وأنه لا ينقصنا سوى البحث الجاد لاستغلال مواردنا الطبيعية على النحو الذي يكفل لنا حسن السير في موكب التقدم العلمي.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafklJ3icZ_wvA34pmNNTZuGzZ4unYdqlyZmx4DfXG7XIfBrjfwBNms9JH-AqvLgj2-hGgNyisGelOnf6JM2wGdd7xx8Kg665PAkydaaT0RECAY13mef10CsBioqu08cMQONNfQReTqJFgSjWfFI2aIvRMtnWj1QbG7eEy5Fq8AFIUov8mJt7kJVrp09zouanG9IiTQmckjiLHA2FDl7y3Qzk5XnOfbT99SqfPWPaHXyZognzCqOrRq06Ym5wrjSZOhyfaLlF4VyHh7uUoGAMJQ0JjN1lxUghArk_uP1_FM4dF_ii9w',
            'category_id' => '5',
        ]);
        Book::create([
            'book_name' => 'فيزياء الطاقة الشمسية',
            'author' =>'سي جوليان تشن',
            'rate' => '3.12',
            'image' => 'image/1685040285.jpg',
            'book_details' => 'تُعَدُّ الطاقةُ أحدَ أكبرِ التحدياتِ التي تُواجِهُ البشريةَ في القرنِ الحادِي والعشرين؛ فمَصادرُ الوَقودِ الحفري، التي نعتمدُ عليها لتَزويدِنا بالطاقةِ اللازمةِ لتسييرِ حياتِنا، تتَّجِهُ نحوَ نهايةٍ محتومةٍ في ظلِّ الاستنزافِ الشديدِ للفحمِ والنفطِ والغازِ الطبيعي. أمَّا الطاقةُ الشَّمْسيَّةُ فمُتوافِرة، ولا تَنْضُب، وغيرُ مُضِرةٍ بالبيئة، وعاليةُ الكفاءةِ في الوقتِ نفْسِه، ونستطيعُ من خلالِها توفيرَ احتياجاتِنا المُتزايدةِ منَ الطاقة.

            ويقدِّمُ هذا الكتابُ نظرةً عامةً على الجوانبِ الفيزيائيةِ الأساسيةِ للطاقةِ الشَّمْسيَّة، التي ستكونُ بمنزلةِ الأساسِ للبحثِ والتطويرِ فيما يتعلَّقُ بالتقنياتِ الهندسيةِ الشمسيةِ الجديدةِ في الأعوامِ القادِمة. يُتِيحُ الكتابُ للجيلِ القادمِ من خبراءِ الطاقةِ — سواءٌ في الأكاديمياتِ أو الصِّناعة — معرفةَ الجوانبِ العَمليَّةِ والتطبيقيَّةِ والتقنياتِ الخاصةِ بالطاقةِ الشَّمْسيَّة، كما يَستعرِضُ الأُسسَ التي سيقومُ عليها التوسُّعُ السريعُ المُنتظَرُ في المَشْروعاتِ المُستقبليَّة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacXHc5uP0IZFVLMLAvjIwse7BxE2SDh79EIGad1AGfsFRFudFge8a8GQXRw4wgYnwGYeCWDh-VR-sR3YJW2dF4z92BF3j_UdN_HmRXEfIXE2VomXSrvqEvIGOvmVRn5Qj0E7Wpg_3k0jCfYzhXLZBAuKrOjLoJFZH7ZV3FdyGhBFSOup37p_Ae3Zg8jDnTswh2rnFUfsAIzX4mFIZmOEajSEaaR-x-dNuuvfa2MemGo1u-92tcAQzXPpmcwqT41ZJbou60F7rnZ4nWlbl_eXlyzPvmALeY_FORvynQtxUKIEREcnLI',
            'category_id' => '5',
        ]);
        Book::create([
            'book_name' => 'روعة الكيمياء',
            'author' =>'كاثي كوب',
            'rate' => '3.85',
            'image' => 'image/1685040331.jpg',
            'book_details' => 'اكتشف بنفسك سحر الكيمياء ومتعتها من خلال التجارب العملية. ينظر الكثيرون إلى الكيمياء على أنها علم معقد، تزيد الرياضيات من صعوبته، وتقتصر ممارسته على منشآت بحثية مؤمّنة جيدًا. ومع أن لهذه الجوانب من الكيمياء أهمية قصوى، فإن المعامل والآلات الحاسبة لا تصور بالضرورة الجمال المتأصل في الكيمياء أو المتعة التي تصاحب ممارستها.

            يتحدى هذا الكتاب النظرة السائدة إلى الكيمياء على أنها علم صعب يثير النفور، وجاف إلى درجة تحول دون الاستمتاع به. ففي هذا الكتاب، يقدم المؤلفان للقارئ سحر الكيمياء وجمالها وروعتها؛ إذ يستخدمان مواد مألوفة لنا لتوضيح مفاهيم الكيمياء بلغة الحياة اليومية، بدءًا من تغير ألوان أوراق الأشجار في الخريف، مرورًا بالألعاب النارية، وطريقة عمل كاشف الدخان والحاسبات الآلية.

            يستهل الكاتبان كتابهما بفرقعة: صاروخ الزجاجة الملونة الذي يُركَّب باستخدام أشياء عادية يمكنك أن تجدها في مرآبك، ثم يقدمان مبادئ الكيمياء باستخدام مواد منزلية ولغة غير متخصصة مألوفة لنا. ويوضحان للقارئ أساسيات التركيب الذري، وطبيعة الروابط الجزيئية، وعالم التفاعلات الكيميائية المفعم بالحياة، ويستخدمان التشبيهات والأمثلة لإلقاء الضوء على المبادئ الأساسية، مثل: الديناميكا الحرارية، والكيمياء الضوئية، والكيمياء الكهربائية، والتوازن الكيميائي، كما يفسران أسباب التفاعلات الكيمائية ونتائجها. وتبرز الملاحظات المثيرة متعة وسحر تعلم الكيمياء.

            يثبت هذا الكتاب الممتع الغني بالمعلومات أن الكيمياء يمكن أن تكون علمًا يستهوي عقولنا ومداركنا، ويمكن أيضًا — إذا كان لدينا الاستعداد للتجربة بأنفسنا — أن يكون مصدرًا للمتعة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadALkZki8CnFGR3m2OniSlQVvJhTbI41ufKwyrE4PpEvU84VPbBMOl-9WJx-MNra9Di3prUDyHJnaY2shdNbpOipfqrsRADS3MuFXaZ0MrO8S77JsxlOq9gxez8o-RcalvX7s0zdUJWN2Sqvh5tyWDshODW5iEy-rQVEH-E0qxG6zNRu29Ke6zkzrP6PiQyMUrq7NExZeldDdwiyiRVOkQSAhK4RfYuSMI_tk6po6iNHsJvFzn2Gu9OawZZO4opzjZY802GG1ecCxZSdeV0y45vSqFr4g',
            'category_id' => '5',
        ]);
        Book::create([
            'book_name' => 'المجرَّات',
            'author' =>'جون جريبين',
            'rate' => '3.84',
            'image' => 'image/1685040371.jpg',
            'book_details' => 'في هذا الكتاب الرائع من سلسلة «مقدمة قصيرة جدًّا» يأخذنا الكاتب العلمي الشهير جون جريبين في رحلة حول الكون، نشاهد فيها المجرَّات بداية من المجرات الحلزونية المهيبة — مثل مجرتنا درب التبانة — والبقايا المهلهلة للتصادمات المجرِّيَّة الهائلة، والمجرات النَّشِطة التي تنفث تياراتٍ من الإشعاع في الفضاء، إلى تلك المجرات التي تمكَّنَّا من رصدها بالكاد في أقصى حدود المكان والزمن.

            إن المجرات ليست بنًى فلكية رائعة في حدِّ ذاتها فحسب، بل إن دراستها كشفت لنا الكثيرَ ممَّا نعرفه عن الكون اليوم، مانحةً إيَّانا نافذةً نطل منها على «الانفجار العظيم» وأصلِ الكون. وفي هذا الكتاب يستعرض جريبين مجرَّتَنا — درب التبانة — بالتفصيل، بدايةً من الأنواع المختلفة من النجوم التي تُولَد داخلها، إلى منشأ بنيتها الحلزونية المدهشة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafXrm7n-o3NG9TwkYlF40EOa2yvuK27zIZHOx0Qil8YnUtloHRNGX_rU13QERiLrwHpw6MyhrYZMsM92IOXvYKOWpstE1mToyqBV-tT-s9NF5puvbEBcERai8bgGz2m-3XCMQ69BuKk41zjTsyLXADOaB0JNDtqzYTfJPJdiuKTZ6EQXUQf96GUP1Bs1e4BKNtmoChts-E29mfH1zMxVv35lslL1EVYzpzPXeOQmfstvTJQc3i5XMuyqhhbD7oFcgVy-ZR7',
            'category_id' => '5',
        ]);
        

        book::create([
            'book_name' => '  ماكينة الأفكار',
             'author' => ' ناديا شنتزلر',
             'rate' => '2.59',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafTJf1jHyOvKLkO0E62T1TIIZnTHvqAK7z7-MYhj1c0jKVMdDwXyuwEZVXAlD5VSCuB2J8kI8ghqWLBtE8mcWdfc5Ox1WVTP6UUXX6YZQT7h_omKUsng7ttfCvhT4zBuc7fHVYDjBZTIcembUPIuatZSLL4ie26MScO9w748lL_a-Byxs5MJ85p2lzaptkaCfnzXu1teTEFy6YzDGj1rWp5n9dAGydTFc_TPVi-a6pz9wcpJTb82lUpnBs_SJTnm9W4kkQ7jqrgXTw7kpC0s-P6eXM3sw',
             'book_details' => '
             هَل مِنَ المُمكِنِ إنتَاجُ الأَفْكارِ صِناعِيًّا بالطَّرِيقةِ عَينِها التِي تُنتَجُ بِها المَلابِسُ أو الشُّوكولاتةُ مَثلًا؟ أمْ أنَّ الأَفْكارَ تَتطلَّبُ وَمَضاتٍ مِنَ الإِلهامِ تَصدُرُ عَن مُفكرِينَ لامِعينَ مُبدِعين؟ تَرى مُؤلِّفةُ الكِتابِ أَنَّ الأَفْكارَ تُنتَجُ كغَيرِها مِنَ المُنتَجات؛ وَفْقَ نِظامٍ وتَرتِيبٍ وعَلى مَراحِلَ مُتتابِعة. كَيفَ يُمكِنُ ذَلك؟ الأمرُ بَسِيط؛ باستِخدَامِ مَاكِينةِ الأَفْكار.
             
             ومَاكِينةُ الأَفْكارِ هِيَ نَموذَجٌ مُبتكَرٌ يَعملُ وَفْقَ مَبادِئَ هَندَسِية، ويَشرَحُ لنَا هَذا الكِتابُ كَيفَ يُمكِنُ إِنتاجُ الأَفْكارِ مَنهَجِيًّا وبِكفَاءةٍ باستِخدَامِ هَذا النَّموذَج، كمَا يُوضِّحُ أنَّهُ بمَقدُورِ أيِّ شَخصٍ تَوليدُ أَفْكارٍ جَيِّدة؛ فكُلُّ ما يَحتاجُ إليه هُو أنْ يَعرِفَ الطُّرُقَ الصَّحِيحةَ لِذَلك. ويَحتَوي الكِتابُ عَلى دِرَاساتِ حالَةٍ كَثيرةٍ، وعَلى العَدِيدِ مِنَ الحِكايَاتِ الطَّرِيفةِ التِي تُوضِّحُ للقَارِئِ كَيفَ يُمكِنُهُ استِخدَامُ أدَواتِ إِنتاجِ الأَفْكارِ بِنجَاح.',
             'category_id'=> '6',
            
             'image' => 'image/1684664902.jpg',
         ]);



        book::create([
            'book_name' => 'قوة الوعي الباطني',
             'author' => 'كيمبرلي فريدمتر',
             'rate' => '3.75',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2023/05/D982D988D8A9_D8A7D984D988D8B9D98A_D8A7D984D8A8D8A7D8B7D986D98A_D983D98AD985D8A8D8B1D984D98A_D981D8B1D98AD8AFD985D8AAD8B1D985D988D982D8B9D8A7D984D985D983D8AAD8A8D8A9.D986D8AAwww.maktbah.net28129.pdf',
             'book_details' => 'ق التوافق بين عقلك الواعي وعقلك الباطني ورغباتك اللاواعية
             استعن بفكرك الباطني لتصنع لنفسك الحياة التي طالما أردتها!
             فعّل الطاقة الخام الكامنة في وعيك الباطني من أجل أن تخلق الحياة التي طالما أردتها، باستخدام الدروس الستة المكثّفة التي تقدمها واحدة من أشهر ممارسي التنويم المغناطيسي في العالم.
             وظائف غير مرضية، علاقات سامة ومتقلّبة ومخيبة، أحلام ومشاريع غير متحققة.. الكثيرون منا يعيشون حياة لا تكاد تقترب من تصوراتهم عن الحياة التي يريدونها.
             في هذا الكتاب المؤثر جدًا، تخبرنا كيمبرلي فريدمتر كيف أنه من الممكن أن نصمم حيواتنا كما حلمنا بها دائمَا، وأن طاقة تحقيق ذلك كامنة في وعينا الباطني.
             من خلال ستة مبادئ، تقودنا كيمبرلي لتحقيق التوافق بين عقلنا الواعي وعقلنا الباطني ورغباتنا اللاواعية، وتشارك معنا تمارين ستساعدنا في إعادة تشكيل علاقاتنا وفي إيجاد الحب الحقيقي وفي إنقاص الوزن الزائد وفي تحقيق النجاح في وظائفنا والتقدم فيها، كل ذلك من خلال عرض لقصص نجاح ملهمة وتقديم وسائل علمية ستساعدنا في تحقيق التغيير المطلوب.
             كتاب قوة الوعي الباطني سيساعدنا للتوقف عن كوننا عناصر سلبية غير فعالة في حياة لا ترضينا، وسيدفعنا لاختيار الحياة التي نرغب في عيشها حقًا.',
             'category_id'=> '6',
            
             'image' => 'image/1684664902.jpg',
         ]);



         book::create([
            'book_name' => 'شغف التعلم سر النجاح',
             'author' => 'عمر سليمان العريفي',
             'rate' => '3.63',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2023/05/D982D988D8A9_D8A7D984D988D8B9D98A_D8A7D984D8A8D8A7D8B7D986D98A_D983D98AD985D8A8D8B1D984D98A_D981D8B1D98AD8AFD985D8AAD8B1D985D988D982D8B9D8A7D984D985D983D8AAD8A8D8A9.D986D8AAwww.maktbah.net28129.pdf',
             'book_details' => '
             يقدم مفهوم شغف التعلّم الفعال ويعرض بعض الأفكار والمفاهيم والمهارات التي تساعد الإنسان على أن يتعلم ما يفيده ويستفيد مما يتعلم، فهو محاولة بسيطة لتعزيز ثقافة القاريء ودعم قصة نجاحه عبر بيان من الأفكار ما هو أساسي مشهور، ومن الأسرار ما هو متقدم نادر، ليناسب المبتدئين والمتقدمين في سلم الثقافة والتعلّم والنجاح على حد سواء، فيجد فيه الناشئة والمبتدئين ما يساعدهم على بناء ثقافتهم ودعم مسيرة نجاحهم، ويساعد المثقفين والمتقدمين على مراجعة أفكارهم وتطوير حياتهم وزيادة شغفهم بالتعلّم..',
             'category_id'=> '6',
            
             'image' => 'image/1684666275.jpg',
         ]);
         book::create([
            'book_name' => 'الذكاء العاطفي',
             'author' => 'دانييل جولمان ',
             'rate' => '4.04',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2020/06/D983D8AAD8A7D8A8D8A7D984D8B0D983D8A7D8A1D8A7D984D8A7D8ACD8AAD985D8A7D8B9D98AD8AFD8A7D986D98AD98AD984D8ACD988D984D985D8A7D986D985D8AAD8B1D8ACD985.pdf',
             'book_details' => 'المؤلف قام من خلال كتابه برحلة تامل علمي ثاقب في عواطف الانسان نفهم منها معنى الذكاء وكيفية ارتباطه بالعاطفه ونطلع عبر صفحاته على مملكة المشاعر وتاثيرها في مسار حياتنا. كما اعتمد الامؤلف على الابحاث الطبية والدراسات التي اجريت على الدماغ البشري.واجاب عن السؤال المهم ما هذه المشاعر الانسانية وما مكانها في الدماغ وهل ورثناه من طباع قدر محتوم ام ان دوائر المخ العصبية دوائرمرنه يمكن ان تتعلم تتغذى وتقوى وفقا للبنية التي يتاسس عليها ذكاؤنا العاطفي منذ الطفوله. اما اكثر الحقائق اثارة للقلق في هذا الكتاب فهي ذلك المسح البحثي الشامل الذي يكشف كيف بات جيل الاطفال الحالي في العالم كله اكثر غضبا وجنوحا وقلقا وانفاعا وعنفا فهل الذكاء العاطفي يقدم علاجا .',
             'category_id'=> '6',
            
             'image' => 'image/1684668130.jpg',
         ]);
         book::create([
            'book_name' => 'قوة التفكير الايجابي ',
             'author' => ' يوسف اسكندر ',
             'rate' => '4.17',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2023/03/D982D988D8A9_D8A7D984D8AAD981D983D98AD8B1_D8A7D984D8A5D98AD8ACD8A7D8A8D98A_D984D980_D986D988D8B1D985D8A7D986_D981D98AD986D8B3D98AD986D8AA_D8A8D98AD984_Ktaab.pdf',
             'book_details' => ' ل تعاني من الإحباط والفشل؟
             هل تسودك روح الانهزام والكآبة؟
             هل تشعر بصغر النفس، وأنك أقل شأناً من الآخرين؟
             وهل تعاني من إعاقات معينة تعطلك عن التواصل مع من هم حولك؟
             
             إن موضوع هذا الكتاب يضعك على طريق السعادة والنجاح بل والتفوق ... وذلك من خلال منهاج كتابي وعلمي قام الكثيرون بتجربته عملياً، وكانت النتائج مذهلة ... ويدون الكاتب قصص هؤلاء الأشخاص وكيف تغيرت حياتهم جذرياً، وتحولت من الكآبة إلى السعادة، ومن الفشل إلى النجاح، ومن اليأس إلى الرجاء ..
             إنه كتاب لابد أن يُقرأ للتغلب على صعاب الحياة، وتحقيق الأهداف العظيمة.
             ',
             'category_id'=> '6',
            
             'image' => 'image/1684669798.jpg',
         ]);
         book::create([
            'book_name' => '  معجزة الصباح ',
             'author' => '  هال الرود ',
             'rate' => '3.91',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2020/09/D985D983D8AAD8A8D8A9D986D988D8B1D8A7D984D8B5D8A8D8A7D8ADD8A7D984D985D8B9D8ACD8B2D8A98D8B9D8A7D8AFD8A7D8AAD8AAD8BAD98AD8B1D8ADD98AD8A7D8AAD983D982D8A8D984D8A7D984D8ABD8A7D985D986D8A9D8B5D8A8D8A7D8ADD8A7.pdf',
             'book_details' => ' كتاب معجزة الصباح العادات ال6 لتغيير حياتك قبل ال8 صباحا  تأليف هال الرود .. من اهم كتب التنمية التي تحدثت عن النهوض باكراً قبل شروق الشمس⁣ تحدث الكاتب عن قصة حياته ونجاحه وعن الحادث المؤلم الذي كاد ان ينهي حياته وفتره تعافيه ورجوعه الى عمله بأحسن من قبل الى ان حدثت النكسة الاقتصادية في امريكا واصبح مديوناً ٤٠٠ الف دولار وكيف ثابر على تخطيه هذه الازمه وذكر من اهم هذي العادات هي النهوض قبل الوقت الافتراضي بساعه حتى مع نهايه الاسبوع ⁣ قسم نصائحه لممارسه منقذات الحياه وهي⁣ ١- الجلوس بصمت للتأمل والصلاة⁣ ٢- ممارسة الرياضة⁣

             ٣-تكرار التوكيدات بطريقه تخدم اهدافك⁣
             ٤- ممارسه عمليه التخيل وكان الاهداف تحققت⁣
             ٥- كتابه يوميات⁣
             ٦- القراءة⁣
             كل هذه المنقذات تمارس بالساعه ٥ صباحاً يومياً لمده ٣٠ يوماً لكي تصبح نمط حياه
             ',
             'category_id'=> '6',
            
             'image' => 'image/1684669799.jpg',
         ]);


         book::create([
            'book_name' => 'الجريمة الكاملة ',
             'author' => ' أغاثا كريستي ',
             'rate' => '3.94',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2020/07/D983D8AAD8A7D8A8D8A7D984D8ACD8B1D98AD985D8A9D8A7D984D983D8A7D985D984D8A9.pdf',
             'book_details' => '  كتاب  بوليسي مشوق نبتت من أرض الواقع، وتمت تفاصيلها في رحاب خيال اجاثا كريستي التي تقنع من خلال أجواء رواياتها بأنها لا بد أنها كانت تعمل مخبرة بوليسية. فالأحداث المتدافعة التي تسبق أحياناً الجريمة، أو تلك التي تواكبها والتحقيقات التي تجري، والتكهنات التي تفترض والأجواء التي يعيشها القارئ بكل مشاعره المشحونة بالغموض، كلها تشترك مجتمعة في بناء كيان روائي ذا نكهة بوليسية، احتل حيزاً كبيراً في عالم هذه الرواية، التي كانت اجاثا كريستي أهمّ روادها. واحدة من روايات الكاتبة العالمية لأشهر القصص البوليسية في التاريخ،أجاثا كريستي تحت اسم الجريمة الكاملة                                     ',
             'category_id'=> '7',
            
             'image' => 'image/1684688175.jpg',
         ]);

         book::create([
            'book_name' => '  لغز رامي القنبلة',
             'author' => '  روبرت بار ',
             'rate' => '3.29',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2021/10/17248486.pdf',
             'book_details' => ' رواية عن المفتش الفرنسي يوجين فالمونت فى مغامرة جديدة
             فى عالم اللاسلطويين والعلاقة بين لندن وباريس بكل ما تحتويه
             من أسرار وخفايا..
             ستعيش مع يوجين فالمونت المحقق الشهير...
             وبول دى شارم أستاذ اللغة الفرنسية وفيليني الأناركي وغيرهم
             بين احداث متلاحقة فى جو من الأثارة ..
                                                ',
             'category_id'=> '7',
            
             'image' => 'image/1684688451.jpg',
         ]);
         book::create([
            'book_name' => ' لغز محطة تشارينغ كروس ',
             'author' => '  جوزيف سميث فليتشر ',
             'rate' => '3.09',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2023/05/D984D8BAD8B2_D985D8ADD8B7D8A9_D8AAD8B4D8A7D8B1D98AD986D8AC_D983D8B1D988D8B3.pdf',
             'book_details' => '   رجلٌ يموت فجأةً على نحوٍ غامض وهو على متن قطار، ويختفي الشخص الوحيد الذي كان مُصاحبًا له من دون أثرٍ في محطة قطارات «تشارينج كروس». يتصادف أنَّ محاميًا شابًّا قد شهد هذه الحادثة، ونظرًا لطبيعتها الغريبة فقد أثارت فضوله، وأبى أن يَكفَّ عن البحث قبل أن يَعرف السِّر وراء هذه الوفاة؛ فينهمك في التحريات مع مفتش الشرطة المسئول عن القضية. تُصبِح الأمور أكثر تعقيدًا حين يكتشفان أن المُتوفَّى كان ضابطَ شرطة متقاعدًا، وقد ظهرَت شخصيةٌ من ماضيه في العمل الشرطي في حياته قُبيل وفاته. ومع التحقيقات يظهر المزيد من التعقيدات والتساؤلات والشخصيات المثيرة للجدل. تصل هذه الأحداث الغامضة إلى ذُروتها، فهل سيتمكن المحامي ومفتش الشرطة من كشف السِّر الكامن وراء هذا اللغز.                                 ',
             'category_id'=> '7',
            
             'image' => 'image/1684688461.jpg',
         ]);
         book::create([
            'book_name' => ' جريمة ميدل تيمبل  ',
             'author' => ' جوزيف سميث فليتشر ',
             'rate' => '4.67',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2023/05/D8ACD8B1D98AD985D8A9_D985D98AD8AFD984_D8AAD985D8A8D984.pdf',
             'book_details' => ' على مَدخلِ صرحِ «ميدل تمبل» المُنيف لإعداد رجال القانون، يُعثَر على جثةٍ في ظروفٍ غريبة، وسرعان ما يَتحوَّل الأمر إلى قضيةٍ كبرى، ولغزٍ لا سبيلَ إلى حله سوى قصاصةِ ورقٍ صغيرة كانت كلَّ ما وُجِد مع الجثة. تقوم الدنيا ولا تقعد، ويبدأ رجال الشرطة التحقيقَ على غير هدًى، حتى يَتدخَّل الصحفي النابه «فرانك سبارجو» ويُطوِّع كلَّ مهاراته الاستقصائية للقضية، فتنفتح دفاترُ الماضي، وتقود تلك الجريمةُ إلى سلسلةٍ من المفاجآت غير المُتوقَّعة، ويسقط الكثير من الأقنعة. فهل سيُكشَف اللثام ويُكتشَف القاتل، أم تظل الحقيقة عَصِية على الظهور؟ هذا ما سنعرفه من خلال أحداث هذه الرواية البوليسية الشديدة الإثارة                           ',
             'category_id'=> '7',
            
             'image' => ' image/1684688416.jpg',
         ]);
         book::create([
            'book_name' => ' صرخة في سوهو',
             'author' => ' جوهان براندون  ',
             'rate' => '3.30',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2022/10/D8B5D8B1D8AED8A9_D981D98A_D8B3D988D987D988.pdf',
             'book_details' => '.       تدور أحداث الرواية أثناء الحرب العالمية الثانية؛ حيث يُسمَع صوت صرخة تَصمُّ الآذان، ويُعثَر على آثارِ دماءٍ وسكين في «سوهو سكوير» بلندن. يتولى المفتِّش «مكارثي» التحقيق في القضية التي يلفُّها الغموض؛ ليجد أن الضحية من أصلٍ ألماني، وأن لها صِلةً بعمليةِ تجسُّس لسرقةِ خُططٍ مهمة من «وايتهول»، ويقوده ذلك إلى أنَّ سبب الجريمة هو صراع مخابراتي للحصول على هذه الخُطط. ويتبع المفتِّش حدْسَه الذي يدفعه للشك في صِلةِ رجلٍ ألماني بذلك الصراع، وبينما يُحاول فكَّ خيوط هذا الصراع الغامض الذي يقع بسببه المزيدُ من جرائم القتل، يكتشف أن إحدى العصابات الإيطالية في «سوهو» لها صِلة بتلك الجرائم وبعملية التجسُّس. كذلك يُفاجأ المفتِّش بأن إحدى البارونات النمساويات التي تُقيم في لندن مُتورِّطة في الأمر. يُحاول المفتِّش «مكارثي» استعادةَ تلك الخُطط الشديدة الأهمية والقبضَ على مُرتكِبي تلك الجرائم، فهل سيَنجح في ذلك؟ هذا ما ستَكشِف عنه أحداثُ هذه الرواية المثيرة.                          ',
             'category_id'=> '7',
            
             'image' => 'image/1684688402.jpg',
         ]);
         book::create([
            'book_name' => 'رجال العدالة الثلاث  ',
             'author' => '  ادجاروالاس ',
             'rate' => '3.48',
             'path' => 'https://www.arab-books.com/wp-content/uploads/2022/12/D8B1D8ACD8A7D984_D8A7D984D8B9D8AFD8A7D984D8A9_D8A7D984D8ABD984D8A7D8ABD8A9.pdf',
             'book_details' => 'استحوذَت قضيةٌ جديدة على اهتمامِ رجال العدالة الثلاثة، الذين يسعَون إلى إعلاء كلمة الحق، وإرساءِ قواعد العدالة، ومطاردةِ المجرمين والخارجين عن القانون داخل إنجلترا. بدأت الأحداثُ بسقوط ضحايا لأفعى طليقةٍ في شوارع لندن أثارت الرعبَ بين أهالي المنطقة، وهو ما جعل «جورج مانفريد» وصديقَيه «جونزاليس» و«بويكارت» يُتابعون الأمرَ عن كثَب، ويربطون الخيوطَ بعضَها ببعض. وبالفعل، تَوصَّلوا إلى وجودِ صلةٍ بين ظهورِ هذه الأفعى وتشكيلٍ عصابي يَترأَّسه رجلٌ سويدي يُدعى «أوبيرزون»، لديه شركة ذاتُ أنشطةٍ مُرِيبة ومُتعدِّدة داخل البلاد وخارجها. بيدَ أن أكثرَ ما أثار حفيظةَ رجال العدالة الثلاثة، هو مُحاوَلة عصابة «أوبيرزون» اختطافَ فتاةٍ ريفية بسيطة تُدعى «ميرابيل» دونَ أسبابٍ واضحة؛ فهي ليست مَطمعًا بالنسبة إلى عصابةٍ عاتيةِ الإجرام تسعى إلى تحقيق الثراء فوق جُثثِ ضحاياها، بل فوق جُثثِ أفرادها أحيانًا! تُرى هل يستطيع رجالُ العدالة الثلاثة كشْفَ السر وراء استهداف هذه الفتاة بالذات، واصطيادَ الأفعى المراوِغة؟ هذا ما سنعرفه من خلال أحداث هذه القصة المشوِّقة.
             ',
             'category_id'=> '7',
            
             'image' => 'image/1684688438.jpg',
         ]);

        book::create([
           'book_name' => 'رحلة في عالم الموضة',
            'author' => 'ليزا جيه سبرينجستيل',
            'rate' => '3.0',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaf-gL9BsI57kuNXVD6G0TqiJsdSNs65x7sbTiRR_eYimqEYfnT2cM1SjYriONHco45_zf4Ly4Wg0zy0rWa2TcYWMBDc80tHErFcruAoQxX_Ty3wzbEUUsMYQp9zXL8S80_dsaZVkx-5SwMCa_basrpN7uIuSNHqwfIen76tgKFSS1zFAabOxo_p2XSOiHTyUfxMa62Z2sdaR7dJHZZ3aTtAlCF-OLOclx_c3byJXGjRq5dzJe-4cLtKpbzYSR2vytI8cKhBfbtZo8kWKjhpmhCJs0gT8w',
            'book_details' => 'يُعَدُّ هَذا الكِتابُ دَلِيلًا عَمليًّا شامِلًا لِأُولِئكَ الَّذِينَ يَسعَوْنَ إلى دُخولِ عالَمِ صِناعةِ المُوضَة؛ إذْ يَتضمَّنُ مُقابَلاتٍ شَخصيَّةً معَ كِبارِ المُصمِّمينَ الَّذِينَ يَكشِفُون خَبايَا عالَمِ تَصمِيمِ الأَزْياء. يُدرِكُ كُلُّ مَن يَرغَبُ في بَدْءِ العَملِ فِي مَجالِ تَصمِيمِ الأَزْياءِ مَدَى صُعوبةِ هَذِهِ المُهمَّة؛ إذْ تُعَدُّ صِناعةُ الأَزْياءِ بِيئةً تَنافُسيَّةً شَدِيدةَ الحِمايةِ والتَّكتُّمِ يَصعُبُ التَّسلُّلُ إلى داخِلِها ومَعرفةُ أَسْرارِها. ويُقدِّمُ هَذا الكِتابُ جميعَ المَعْلوماتِ والمَصادِرِ والأَدْواتِ الَّتِي تَحتاجُها لِمُساعَدتِكَ عَلى اجْتِيازِ هَذِهِ العَقَبات، والنَّجاحِ في بَدْءِ عَملِكَ في مَجالِ تَصمِيمِ الأَزْياء. يُلقِي الكِتابُ الضَّوءَ عَلى فُرَصِ العَملِ المُتاحةِ في مَجالِ صِناعةِ المُوضَة، ويُبيِّنُ عِدَّةَ طُرقٍ يَستطِيعُ بِها مُصمِّمُ الأَزْياءِ الطَّمُوحُ أنْ يَتميَّزَ عَلى المُنافِسِين. وبوَصْفِه دَلِيلًا عَمَليًّا شامِلًا، يَحتوِي الكِتابُ عَلى نَصائِحَ قَيِّمةٍ مِن كِبارِ المُصمِّمِينَ والتَّنفِيذيِّينَ في مَجالِ الأَزْياءِ مِن مُختلِفِ أَنْحاءِ العالَم. وتَشتمِلُ تِلكَ النَّصائِحُ عَلى التَّعرِيفِ بالعَملِ فِي مَجالِ تَصْميمِ الأَزْياء، والمُتطلَّباتِ التَّعلِيميَّةِ لِذَلك، وفُرَصِ العَملِ المُتاحَة، وتَفاصِيلِ عَمليَّةِ التَّصمِيم، وخُطواتِ تَأْسيسِ وإِدارةِ شَرِكتِكَ الخاصَّةِ في مَجالِ تَصمِيمِ الأَزْياء، والتَّنبُّؤِ أيضًا بمُستقبَلِ تِلكَ الصِّناعَة. وسَواءٌ أَكُنتَ طالِبًا، أمْ خِرِّيجًا جامِعيًّا حَدِيثًا، أمْ مُتخصِّصًا في هَذا المَجال، أمْ ساعِيًا لتَغيِيرِ مِهْنتِك؛ ستَتعلَّمُ كُلَّ شَيءٍ تَحتاجُ إلَى مَعرِفتِه لتَحقِيقِ تَطوُّرٍ وَظِيفيٍّ ناجِحٍ فِي مَجالِ تَصمِيمِ الأَزْياء.',
            'category_id'=> '8',
           
            'image' => 'image/1684572822.png',
        ]);
        book::create([
            'book_name' => 'تأمل يوما بعد يوم',
             'author' => 'كريستوف أندريه',
             'rate' => '5.0',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeOyniLGnAofYBKpDMu_QaKCCuycpcxNBXjwzaWLjBYr9dw4B-cwoth_oEwRzrHWpT7J7uzt0Mp58Ek3Am4CvX2GE3nngHoj0X654XOpP7PV2_-YmHmBKKuESHjkQXaY4y_lsaj5LOC3c30Gc7ehFHiDrUreMcbirV6GA5CkMOjDv0gk4783PXpwpM1s9yxEhsjh7BxBhORHXFg8lgDSAZa9NFrJWip-ynyzugLyFWChlozfN1B7-b73rmmP2av7gEKz90MBKXYnPINunueqLNtsjjmczDuoqoCupZStlGVBUufrNg',
             'book_details' => 'لا يَعني التأمُّلُ أن نقطعَ علاقتَنا معَ العالَم، بل بالعكس، أنْ نقتربَ منه أكثرَ كي نفهمَه، ونُحبَّه ونُغيِّرَه. إنه أيضًا وسيلةٌ يستطيعُ كلُّ شخصٍ أنْ يستخدمَها كي يزرعَ الهدوءَ داخلَه ويَتذوَّقَ طَعمَ السَّعادة.

             إنَّ الهدفَ من هذا الكتابِ أنْ يكونَ دليلَ عملٍ للبدءِ بتعلُّمِ التأمُّلِ بالوعيِ الكامل، الذي يُعَدُّ أكثرَ طُرقِ التأمُّلِ سِحرًا، والذي دَرسَتْه وأثبتَتْ فاعليتَه العديدُ مِنَ الدِّراساتِ العِلْميةِ الحديثة. إنَّ هذا النوعَ منَ التأمُّلِ ليسَ مُجردَ طريقةٍ علاجيةٍ أو مُمارَسةٍ يوميةٍ لنشاطٍ ما؛ إنه طريقةٌ للعَيش، تَفتحُ لنا أبوابًا مُؤصدةً وتَقودُنا إلى عَوالمَ لم نكتشفْها من قبل، لكنَّها كانتْ دوْمًا في دَواخلِنا.
             
             من خلالِ ٢٥ درسًا يَعرضُها لنا هذا الكِتاب، نستطيعُ التعرُّفَ على الأساسياتِ في هذا النوعِ منَ التأمُّل؛ بَدءًا منَ الركائزِ الأُولى — كيفَ يُمكِنُنا أنْ نستخدِمَ تنفُّسَنا، وجسَدَنا، ووَعْيَنا للَّحظةِ الحاضِرة — حتى الوصولِ إلى حالةِ التأمُّلِ العَميقِ واستخدامِها لمُواجَهةِ المُعاناة، وخلْقِ توازُنٍ في مَشاعرِنا، ومُراكَمةِ السلامِ في الرُّوحِ والقَلب.
             
             
             هذه الترجمة العربية صادرة ومتاحة مجانًا بموجب اتفاق قانوني بين مؤسسة هنداوي ودار نشر ليز إدسيون دي لا أيكونوكلاست. حقوق الترجمة محفوظة لمؤسسة هنداوي.
             ',
             'category_id'=> '8',
            
             'image' => 'image/1684573540.png',
         ]);
         book::create([
            'book_name' => 'الاألوان والاستجابات البشرية',
             'author' => 'فيبر بيرين',
             'rate' => '3.2',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadOQovAjueb4Hk8Yzn9vXD4SgMEPWX5zhtRLM6yK8XT0ZorNcj6xi0aG5ObdhdYHwZXLzFbwhXMhqv52_We4kn5pRU-4-jWP5aubfoD6uTxvWACRGyRB1wUS5v44exudnUzyqGUlLJ6fJGELeL7sU2yRbOI4-V7NoGVo4qYbeU5kSLxZIke_A8L2pvbXQGPaJ_5REI3vFrRJeIghBtgy2Z0XunAyBIo92XyG686GG9u-e48v8XCUCSceQPAWM9t6rNoygKzbscVKvMJDpBT9BBI4Zejqbd6jC-kzxHEd_IElJDRNvg',
             'book_details' => ' هذا عمل رائد كتبه أحد أشهر المتخصصين الثقات في مجال الألوان على مستوى العالم. كان فيبر بيرين رائد مجال اللون «الوظيفي» — أي استخدام خصائص اللون لتعزيز رفاهية الإنسان على المستوى النفسي والبصري والفسيولوجي — وقد جمع في هذا الكتاب ثروة من المعلومات عن هذا الموضوع. يقدم الكتاب ملاحظات واقعية وافتراضية مثيرة حول تأثيرات الألوان في الحياة، مدعومة بإشارات مرجعية تاريخية ومدعومة أيضًا بأحدث البيانات العلمية. كما يستعرض بيرين الاستجابات البيولوجية والبصرية والعاطفية والجمالية والنفسية للألوان، مشيرًا إلى الاستخدامات الرمزية للألوان قديمًا وكذلك إلى تطبيقاتها في البيئة المعاصرة. وتهدف توصيَّاته حول الألوان المُستحَب استخدامها في المنازل والمكاتب والمستشفيات والمدارس إلى تخفيف مظاهر التوتر والقلق في حياتنا المعاصرة. إن هذا الكتاب بما يحويه من رسوم وصور فوتوغرافية — بالإضافة إلى فصل كامل عن معنى تفضيل الشخص للون معين — سوف يبهر كلَّ المهتمين بالبيئة البشرية، من علماء ومتخصصين نفسيين. وقد أصبح هذا الكتاب مرجعًا أساسيًّا للمهندسين المعماريين والمُعلِّمين ومُهندسي الدِّيكور والمُصمِّمين الصِّناعيين
             ',
             'category_id'=> '8',
            
             'image' => 'image/1684572505.png',
         ]);
        
         book::create([
            'book_name' => ' الموسيقى والغناء عند العرب',
             'author' => 'أحمد تيمور باشا',
             'rate' => '5.0',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QafMdZc3RH6i8txKL-tiHmQ15o4rjnAeBIyYBXA2IMeslF4p3YYGMELEN1z-PqLM7I_NgcpjJRnKQcrXgzbrAdcNX2-hK1jbSOZmWXzbMLMbrYlZ_qN0qwL6V1YNrup_lwzvbJMtIsNwDPEUZPnlN0TGcfHWHQFngwV_31BFTePZob5KAGIA7HDy7rNhVV8QitLIC992VW550N-hk8upSffEOHxf0n-OrL8vELyFQOmBmT-Uhkgv8MXljV8l5j6QqL40jIZ9HcEPDC7A_H-PBXNOIKwiiHIRlQZwKWMOvmVdjOOhtP8',
             'book_details' => 'للموسيقى العربية تاريخٌ طويل، يَمتدُّ من أقدم العصور إلى وقتنا هذا، مرورًا بالعصور الوسطى والدول الإسلامية والممالك الأندلسية. وقد تَفرَّد العربُ بآلاتهم الموسيقية المميزة، وكذلك ألحانهم العربية الأصيلة؛ فأَخذَت عنهم الأممُ ألحانَهم وإبداعَهم في تطويع الشعر للألحان، ومن أشهر مَن فعَل ذلك «الفارابي» الفيلسوف الكبير. وليس أدَل على حرص العرب على الموسيقى وشغفهم بها من قصصِ مجالس أهل الغناء والموسيقى ونوادرهم وندواتهم وتَنافُسهم في إمتاع الخلفاء والأمراء الذين أغدقوا عليهم من رعايتهم وأموالهم حتى أصبحوا من أهل حاشيتهم وخاصَّتهم. والعلَّامة «أحمد تيمور باشا» هنا يطوف بنا في أعماق تاريخ الموسيقى عند العرب، فنَتعرَّف على أنواعها وأدواتها، وعلى أشهر مَن أطربَ الآذان وأمتعَ العرب، وأهمِّ المخطوطات العربية في علم الموسيقى.
             ',
             'category_id'=> '8',
            
             'image' => 'image/1684573558.png',
         ]);

         book::create([
            'book_name' => 'الفيلسوف وفن الموسيقى',
             'author' => 'جوليوس بورتنوي',
             'rate' => '5.0',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeoQAKufS6L4eR4PyMp76gb-yYmXJ8nCQbISvifb01OBVeIHHcOrlohVLYKpbundV_G20F6ws43tAPF0XpWi9xdoRaLI2ZwGJEMTLLn5T7-sXWXpiLGUexPhSyRM8DvbJaxg_2Ep3VvlDfrLAZY6y3P9Z0xDB1iDyvzi9PacM-tlm7Ei7tHdIl4qJtjKTNzHj7cunK8ekhpD9hfe_MF4cdFsAldbWpKqX_eQ08tntP8XqDCWsHGTBKyqzyG_BVi7QHz203bgXQ5Z2vD8j4zyP_Lu-mMAnkc_LJEB0M_R6DzsVdZF_Y',
             'book_details' => '«في هذا الكتاب محاوَلةٌ لدراسة ميدان لم يُطرَق من قبلُ على نطاقٍ واسع، وهو العلاقة بين آراء الفلاسفة وتطوُّر الموسيقى على مر العصور؛ ذلك لأن من المألوف أن نجد دراساتٍ تُكتَب عن فلسفة الموسيقى، أو عن آراءِ فلاسفةٍ معيَّنين أو مدارسَ فلسفية خاصة في الموسيقى، أمَّا تأثيرُ الفلسفة ذاتها في مجرى الموسيقى، فهو موضوعٌ لم يُكتَب فيه الكثير من قبل.»

             للموسيقى تأثيرٌ كبير على الحالة النفسية والأخلاقية للإنسان؛ ولذا فقد أَولاها الفلاسفة عنايةً خاصة، فراحوا يَدرُسون هذا الفنَّ من حيث طبيعته، وتأثيره، وعلاقته بقوانين الطبيعة، وأصبح لآرائهم تأثيرٌ كبير على تطوُّره. يُقدِّم هذا الكتابُ عرضًا تاريخيًّا لهذه الآراء ولأصول التفكير الجمالي في الموسيقى، الذي تَرجِع جذوره إلى الفيلسوف اليوناني «أفلاطون»، الذي أرسى الرؤيةَ الفلسفية للموسيقى باعتبارها قوةً هائلة يستطيع الإنسان أن يستغلَّها في الخير والشر على السواء، ويمتدُّ نفعُها أو ضرَرُها حتى يشمل المجتمع بأَسْره، فَضلًا عن أن الموسيقى المصحوبة بالكلمات والشعر أكثرُ نفعًا وتأثيرًا من الموسيقى الخالصة. ولقد تحكَّمَت هذه الرؤية في موقف الفلاسفة من الموسيقى طَوالَ عصور الحضارة الغربية، وظلَّ هذا التأثيرُ حتى بدايات القرن التاسع عشر؛ إذ حدثَت تطوُّراتٌ جَذْرية في الفن الموسيقي نفسِه تسبَّبت في إعلان استقلاله الذاتي، واتِّخاذه شكلًا أكثرَ تجريدًا.
             ',
             'category_id'=> '8',
            
             'image' => 'image/1684573117.png',
         ]);

         book::create([
            'book_name' => 'الغناء للأطفال عند العرب',
             'author' => 'أحمد عيسى',
             'rate' => '2.0',
             'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QadJMz9ogRqbMxBG01Im_CxlCjS1hKMpze7a6fdnAVkwt3gUP6oZC3MDvNOCAlpbrMw-AWpY4l6B-iHzPSQuK71tbKeLA5my-R8rQfd6Zn3ZSY2etUTmlzly_AmApuUsqIAjzvnD4-GoWJXPKNylSjY04Ek4gORsQVJ98u4vRjYCrmgkkPOSOwUTiLHNyXmMwLKImal4H7T184mNhaJk2w67qwdpriOyBuHtD2AI0x4-tGdZBbWIspy0Qje2oKHhxSDGGbPUoZtnLROhpp-gBnyB3eCcT1Zdo4oWrlat13sUShux5zA',
             'book_details' => '«في هذا الكتاب محاوَلةٌ لدراسة ميدان لم يُطرَق من قبلُ على نطاقٍ واسع، وهو العلاقة بين آراء الفلاسفة وتطوُّر الموسيقى على مر العصور؛ ذلك لأن من المألوف أن نجد دراساتٍ تُكتَب عن فلسفة الموسيقى، أو عن آراءِ فلاسفةٍ معيَّنين أو مدارسَ فلسفية خاصة في الموسيقى، أمَّا تأثيرُ الفلسفة ذاتها في مجرى الموسيقى، فهو موضوعٌ لم يُكتَب فيه الكثير من قبل.»

             للموسيقى تأثيرٌ كبير على الحالة النفسية والأخلاقية للإنسان؛ ولذا فقد أَولاها الفلاسفة عنايةً خاصة، فراحوا يَدرُسون هذا الفنَّ من حيث طبيعته، وتأثيره، وعلاقته بقوانين الطبيعة، وأصبح لآرائهم تأثيرٌ كبير على تطوُّره. يُقدِّم هذا الكتابُ عرضًا تاريخيًّا لهذه الآراء ولأصول التفكير الجمالي في الموسيقى، الذي تَرجِع جذوره إلى الفيلسوف اليوناني «أفلاطون»، الذي أرسى الرؤيةَ الفلسفية للموسيقى باعتبارها قوةً هائلة يستطيع الإنسان أن يستغلَّها في الخير والشر على السواء، ويمتدُّ نفعُها أو ضرَرُها حتى يشمل المجتمع بأَسْره، فَضلًا عن أن الموسيقى المصحوبة بالكلمات والشعر أكثرُ نفعًا وتأثيرًا من الموسيقى الخالصة. ولقد تحكَّمَت هذه الرؤية في موقف الفلاسفة من الموسيقى طَوالَ عصور الحضارة الغربية، وظلَّ هذا التأثيرُ حتى بدايات القرن التاسع عشر؛ إذ حدثَت تطوُّراتٌ جَذْرية في الفن الموسيقي نفسِه تسبَّبت في إعلان استقلاله الذاتي، واتِّخاذه شكلًا أكثرَ تجريدًا.
             ',
             'category_id'=> '8',
            
             'image' => 'image/1684572812.png',
         ]);
         
        

         Book::create([
            'book_name' => 'الملك لير',
            'author' =>'كامل كيلاني',
            'rate' => '3.56',
            'image' => 'image/1685040498.jpg',
            'book_details' => 'تحكي عن لير ملك بريطانيا الأسطوري الذي عاش شبابه فارس من أقوى الفرسان، وعندما تقدم به السن قرر تقسيم ملكه بين بناته الثلاث «جنريل» و«ريجان» و«كردليا» ثم طلب من بناته الثلاث أن يعبرن عن حبهن له. لم تتملق ابنته الثالثة في مدحه كما فعلت الأخوات الكبريات، لذلك غضب عليها لير ظنًا منه أنها لا تحبه وطردها من مملكته بلا شيء ولكن تزوجها ملك فرنسا لأنه رأى أنها لا تطمع بشيء من المال.

            وحينما تمكنت الفتاتان «جنريل» و«ريجان»، قامتا بطرد أبوهما من المملكة، لذا قررت «كردليا» أن تساعد أباها فأرسلت جيش قوي إلى إنجلترا وقامت حرب بين إنجلترا وفرنسا من أجل تحرير الملك لير. بعد ذلك انهزم جيش فرنسا وانتصر جيش إنجلترا فقامت «جنريل» وأختها «ريجان» بإلقاء القبض على «كردليا» والملك وأسروهما في السجن. وعندئذ عرف الملك لير كم تحبه ابنته كردليا. وأن ما قامت به الأختان الأخرتان ما هو إلا تملق من أجل الحصول على العرش. فندم ندما شديدا.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaerV4ngeQ8IsS0cAfAxUn-dD8WK5AEjaCbJvrHwM5dJoJnKWp3xBC0h56oIhFKEwVE6ygtmOAUDVz71_x4Uifs859Rer42bsmqUO0hIZTet4NQhVziDEeti10UWntayjs-fz5ePxa7cjbsB9z3yCO6i68_TMMjdOpkv9Pdq7lP2oCGBCDMhuqwYGBDIZgp7VKPZa7Y55gY4gtZlf4PI_Uf__6GyBy2EAifFHFIHTChVLzWIzYc7Z2YAzYDfDPlgLWXcpovxgv53d0V5IKcCSjyGZWkvuA',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'وَزَّةُ السُّلْطَانِ',
            'author' =>'كامل كيلاني',
            'rate' => '3.14',
            'image' => 'image/1685040533.jpg',
            'book_details' => 'ما هي وزة السلطان؟ وما هي قصتها؟ وما علاقتها بجحا؟ هذا ما تحكيه لنا هذا القصة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qac_F03lQWDANflHuBhiCP_ana58jRTcmYO0vjT4gEvr0AZkN-XsAw075ABmcucsEj-8VEm7tvz-7EhPt1ObH4Z-NJY6gq3Qmro6c54mxaq_2XlRr9go1jm49KVKBU7ZJ-WwlMpwTg36LjS9JnuzkZnJuATfRb8RpKNJSi4Pa5l4wzNIwXGtmjMvVijGH_-tjdmwg6hqj4E9HNsm7wust4sQTV1tH2Iox-1YBAwdLXVVc7jvB_gxeF-9f1GAp5uCIEt_TD7Zu7Ftr3bZnEaWOzXLHMNnOtOs3T1fdpNuGAfV64feAdg',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'ليلى والذئب',
            'author' =>'كامل كيلاني',
            'rate' => '3.71',
            'image' => 'image/1685040573.jpg',
            'book_details' => 'هي قصة الفتاة «ليلى» التي أرسلتها أمها بالكعك الطازج إلى بيت جدتها، وفي الطريق يظهر لها الذئب الماكر، فماذا يا ترى هو فاعل معها؟ وأي حيلة سيحتال بها عليها؟ وهل ستنجح حيلته؟',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qad6OaSJVhbL3leMJFAsZPIjI0SsC9iLs43pXEDrybtXKdQUJ-xMFXtYG5petLXPcRB147GJD8uWKN34K8lAEm-PuVjRpOzzLzd4-FkpQPTr6QIKApa0xOyMG8hYvrkmu-4xc8e8Y85jrECh6yzRfaSihUc7g-97BPmeptu7Vxuume3SryT5a45GzKN20D_DsclDxD8zPudf-T1DNZQMFfCkXxCdGlAh9gQIg_O19968XTgvA7NE4-ET7nv_6Pb-Rfa7pkKyPYh3HB6m6AqjkSIwpdeCspm8_sG-dTA6a2uifkvFeX4',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'حكاية بهلول',
            'author' =>'كامل كيلاني',
            'rate' => '2.95',
            'image' => 'image/1685040638.jpg',
            'book_details' => 'يحكي كامل كيلاني حكاية ممتعة ومشوقة، هي «حكاية بهلول». فمن هو بهلول؟ وما هي حكايته؟ وإلى أين ستؤول نهاية هذه الحكاية؟',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacqLhbVYNb1bF8ASlUSUvRBfLpAoWSpgt4KR5PfTc_qmYlLlV7OVAuvYTv97jOCmWHunW-oDTZcfdthktruMOepBEi5jFf2CZdBZo-UxgPAEbx__bShKVSreQrcENE7YH1wULNz1Pe2Y2D7UsjedVrED_Exj4-_o4DCHUUxSf142A15iZhcILFna5M-TzXu5vFqgMJ1LEuP3GiWWehe3nKYCQsr3EkJU4DSy5LnP1RD79tyfl9fMGu0_BDdwYrHEjtmJg0P2cI3ANYcnlxIToHHEyJxSg',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'عجيبة وعجيبة',
            'author' =>'كامل كيلاني',
            'rate' => '3.70',
            'image' => 'image/1685040939.jpg',
            'book_details' => 'تحكي قصة «عجيبة» بنت الملك «نادر»، التي توفي أبوها الملك وهي بعد في الرابعة، فكان من المفترض أن تخلُفه، ولكنها لصغر عمرها لم تتول الحكم، حيث عُين عليها وصيًا، إلى أن تكبر وتصبح قادرة على تولي زمام الحكم بنفسها. فهل ستجري الأمور كما رُتب لها؟ أم أن أمر جديدًا سيطرأ؟ ومن هي يا تُرى «عجيبة» الجديدة؟',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qac0N0-THeq8bBCptfJ9zb9JwHRYxK84wYTX1_IaOd_1hkZsAYxXAiVRmR2_GJwOXqSGuKncL6PHRIDf5D6hLXuZfooFm_JtJdoa-29q-xgXEitRIgNGathJwXOTiJ8LBC6JpMZbz7SM6J9z93uGAG7kB6Ls_pex7XK7BToTdZwqlkqP2F55GqSFX_RYtvH7dTLC_94DO_U_TmDYS0QWgo7MYBjoIZJaFSAeNciRyRcTyAtDyb8auPvZTwDk3MvR6nKxX03ak6uyvcxLNMnGv7BDwjL4zakhhv7BqStgdJ2klGucWio',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'الأرنب الذكي',
            'author' =>'كامل كيلاني',
            'rate' => '3.37',
            'image' => 'image/1685040972.jpg',
            'book_details' => 'قصة مسلية تدور أحداثها بين الذئب والأرنب الذكي، الذي يأكل محصول أرض الذئب، وعندما ينصب له الذئب فخًّا في المرة التالية، يستطيع الأرنب الفرار من هذا الفخ بحيلة ذكية.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacnpCnTJCY54nWZU7hA2tpgD3SawBTYnEKBE9YKlZOt-_sJ7mE0Yj11jCb8Xs8MPqo9skJSy6cPCF4O7oi8MTf2A5CETCsBL7vTaDFE7qm8JsJ2ZWT4Kno7pLVKY42x0L8tP78uWvoe-j6OMp178S8u6QzmYg26LWqqugfJk-PFmLS9rj9Nl3T5NqLxwG5fHSxTpLLRWE2p9AynMGzit0egRav-B75067b3ooKX_3nEzvzXiFoWErSyv1bbB56M0W8dpqXI9Lr8L2bYkSh6AgNqz0LUxhkzYDULkpXtN89y-MiwZdw',
            'category_id' => '10',
        ]);
        Book::create([
            'book_name' => 'العلوم في ثوان للأطفال',
            'author' =>'جین بوتر',
            'rate' => '3.87',
            'image' => 'image/1685041058.jpg',
            'book_details' => 'يحتوي الكتاب على ١٠٨ تجارِب تُغطِّي اثني عشَر مجالًا مختلفًا؛ بما فيها الهواء والحيوانات والطاقة والجاذبية والمغناطيسية والضوء وجسم الإنسان، وغير ذلك. سوف تصنع قوسَ قُزَح على أرضية غرفتك، وتفجِّر بالونًا باستخدام عدسةٍ مُكبِّرة، وستجعل علبةَ البُن تعود إليك بعد أن تدفعها بعيدًا عنك، وستجعل الماء ينحني بينما يتدفَّق من الصنبور؛ كلُّ ذلك بمساعدةٍ تُقدِّمها لك مُعلِّمةٌ رائدة.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QacWaacBb8O79pXS34Vui3XPn4sH2UhdR5hbWOg7phY_Ff4vb8_blEUOxacSG2MOOSKLg-2FKYaVT3MyYUuNfB10NVB36u3VhrjXH-MblNTD9_URJOrxz861QR5oGfak8d6g4jRqIB0CgAcVdNk6k9juRNOrXuqUKAB92aK4Z9Ju-5xnjfZCBsJD57Ng77s-QYVfuKRHg6rMqfruKxRnB-CRAWlN7jRZEJOW3MVtXSmi-KbnspwQSL55URvpOFBa8RUlkkwMR8F31_Coc8HoiGGIrS7xupBYoCnJ0ou23UcdNJktYM0',
            'category_id' => '11',
        ]);
        Book::create([
            'book_name' => 'تعليم الأطفال الإسلام',
            'author' =>'محمد بن شمس الدین',
            'rate' => '4.85',
            'image' => 'image/1685041123.jpg',
            'book_details' => 'هو كتاب مؤلّف لجمع مباحث مختلفة، وأساسيات دين الإسلام مما يلزم المسلم الإحاطة به، وقد صممته بطريقة تناسب أن يُدرَّس بالمعاهد، والمساجد، وكذلك البيت المسلم. وهو على منهج أهل السنّة والجماعة',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5Qaear_7b8K1SXfitqJ8ZT2mgLaGXHtol6eDGWEMpkcYTcbbOHPAPJrbCFrTilruPWmGoIQAKcz5AISKtoFBJbr2EjpchQcNRtPCEY1vrVjycGxoR49rrF9n2HPNXOsWMVkDGyGVCfDoF1OSnc8Kk-Qz_GzAchAnZpKa1J-4rMtztmLZS4yd-OzLcU1arEQe7UauoSGeFqDWUZpGBf-nJ9SjPfU8a_zJ8zw-z3bSFlg88lIsT0b2bZg3522IbD-iPZqnoryaFy_BOEtSPjU18to1OvoK1xKAkmXWZgkvFIr9-uhKSZUc',
            'category_id' => '11',
        ]);
        Book::create([
            'book_name' => 'دروس من النباتات',
            'author' =>'بروندا إل مونتجمري',
            'rate' => '3.58',
            'image' => 'image/1685041183.jpg',
            'book_details' => 'النباتاتُ أسبقُ من البشر في الوجود، وجديرٌ بالبشر أن يتَّخِذوها مُعلِّمًا ومُرشِدًا؛ إذ يجد المتأمِّل فيها كثيرًا من الحكمة. يَطرح هذا الكتاب رؤيةً مختلفةً عن النباتات، ويُعرِّف القارئَ عليها من منظورٍ جديد؛ فالنباتات ليست بالكائنات السلبية الخاملة التي تنمو دونَ وعيٍ بذاتها أو إدراكٍ لمحيطها، بل إن العكسَ هو الصحيح. فلمَّا كانت النباتات ثابتةً في أماكنها، فإنَّ عليها أن تُحقِّق الاستفادة القصوى من بيئتها، وأن تتَّسِم بالمرونة التي تُمكِّنها من التكيُّف، ومن ثَم البقاء، وقد انعكس ذلك في نظامٍ بديعٍ مُعقَّد من الاستجابات؛ ومن أمثلة ذلك: إذا وضعتَ نباتًا محِبًّا للشمس في الظل، فستجد أنه يُطيل ساقَه مُحاوِلًا الوصول إلى الشمس. تَربط المؤلِّفةُ بين عالم النباتات واستجاباتها المعقَّدة المثيرة للإعجاب، وبين ما يُمكِن للبشر أن يَتعلَّموه منها.',
            'path' => 'https://books.googleusercontent.com/books/content?req=AKW5QaeIV7xiZs_EnV2u1hTnob7YFay2IbgQDZ7RxzU0Ta505JjHMIDSKBoEb44ZGUQKCrJFoGmGHl5nfFC2-ajP0zwhbvGrPGGq4vs_yf36iuh2vUpkXcChAXELeO86CKsIFurZwiUoaeLAmlQMah_kCLUCbPuvzyGTuU9-i2REGCWutJ5njr_iUea-7RXUdA3VKAW2zQo69Xgbjd_kPChI0NPMXxx7qRkhMVS2mRZUXtjhvQCMj5D25DY7Rj0B1KnjN4CO-CHKezYVKS9VEDWGWU3LmbSRzQ',
            'category_id' => '11',
        ]);
        Book::create([
            'book_name' => 'الشجاع',
            'author' =>'فيد براكاش',
            'rate' => '3.52',
            'image' => 'image/1685041235.jpg',
            'book_details' => 'تعتمد هذه السلسلة القصصية تمرير المبادئ و الاخلاق الجميلة الى الطفل و تعليمه المبادئ الأولية في التواصل و الأخلاق ذلك بإدماجها في حكايات و قصص فيتم بذلك تمرير الرسائل الإيجابية الى عقل الطفل و مخيلته وينشأ نشأة سليمة.',
            'path' => 'http://www.4newmum.com/32jrrlq.pdf',
            'category_id' => '11',
        ]);
        Book::create([
            'book_name' => 'الواثق بنفسه',
            'author' =>'فيد براكاش',
            'rate' => '3.52',
            'image' => 'image/1685041273.jpg',
            'book_details' => 'تعتمد هذه السلسلة القصصية تمرير المبادئ و الاخلاق الجميلة الى الطفل و تعليمه المبادئ الأولية في التواصل و الأخلاق ذلك بإدماجها في حكايات و قصص فيتم بذلك تمرير الرسائل الإيجابية الى عقل الطفل و مخيلته وينشأ نشأة سليمة.',
            'path' => 'http://www.4newmum.com/33jrrlq.pdf',
            'category_id' => '11',
        ]);
        Book::create([
            'book_name' => 'اكتساب الأصدقاء',
            'author' =>'فيد براكاش',
            'rate' => '3.52',
            'image' => 'image/1685041320.jpg',
            'book_details' => 'تعتمد هذه السلسلة القصصية تمرير المبادئ و الاخلاق الجميلة الى الطفل و تعليمه المبادئ الأولية في التواصل و الأخلاق ذلك بإدماجها في حكايات و قصص فيتم بذلك تمرير الرسائل الإيجابية الى عقل الطفل و مخيلته وينشأ نشأة سليمة.',
            'path' => 'https://ia600802.us.archive.org/9/items/saharelsaman11161_gmail_14/14_%D8%A7%D9%83%D8%AA%D8%B3%D8%A7%D8%A8+%D8%A7%D9%84%D8%A3%D8%B5%D8%AF%D9%82%D8%A7%D8%A1.pdf',
            'category_id' => '11',
        ]);
    }
}
